[
  {
    "title": "Samsung - Galaxy Young 2 DUOS G130 Unlocked GSM Dual-SIM HSPA+ Phone - White",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d4816e",
    "price": 249.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480a1",
        "rating": 3,
        "comment": "Good buy."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809f",
        "rating": 5,
        "comment": "Very good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d6",
        "rating": 5,
        "comment": "Great product - thanks"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48189",
        "rating": 3,
        "comment": "Slow phone, but good for price as an extra/spare unit which is why I got it."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48115",
        "rating": 5,
        "comment": "Excelente.."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e4",
        "rating": 5,
        "comment": "Delivery was excellent 5 stars for efficiency , however I can't rate this product since I purchase it to give it as a present in a couple of months . Once I verify at that time works well I will rate it or return it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48157",
        "rating": 5,
        "comment": "I love the long life battery. Limited instructions though."
      }
    ]
  },
  {
    "title": "Samsung A887 Solstice Quad-band GSM Cell Phone - Unlocked",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d48133",
    "price": 22.5,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ae",
        "rating": 3,
        "comment": "Ok phone. touch screen but not a smart phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c7",
        "rating": 5,
        "comment": "very nice"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813f",
        "rating": 5,
        "comment": "That was an excellent job and the phone is good. Thanks!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48180",
        "rating": 5,
        "comment": "works great no problem went straight on Consumer cellular tkx."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480de",
        "rating": 1,
        "comment": "The worst product I have received so far. Expected it to be new but had many scratches on it the paint was gone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48160",
        "rating": 4,
        "comment": "Bought this for hubby because he just needs a phone to call & text, not a smartphone. This is better than the crappy dumb phones sold at the Phone store. I had had this phone before so I knew it was a good performing phone. Nothing fancy but nice touch screen which locks easy & prevents butt calling. Also full size keyboard for texting. I bought the LAST one from the supplier out of FL. It said refurbished but came in original box & looked new. We just swapped out SIM card & it's working fine! A little pricey at $60, but better than free ones at store!! I would also recommend the LG Vu, I've had it before, if you want a basic phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48158",
        "rating": 1,
        "comment": "Randomly reboots! ! In the middle on conversations, texts, or just sitting on counter. Very garbled background sound. Would not recommend!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812c",
        "rating": 5,
        "comment": "So much easier to use than my previous samsung. I was worry while the battery was charging that I wouldn't be able to read anything on the screen. Tad smaller than I expected & I had to use a magnifying glass to.read the user manual (old eyes). Volume is great and I'm very pleased"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48120",
        "rating": 5,
        "comment": "The phone works well for me. I had no problems when I purchased it and it met all of my expectations."
      }
    ]
  },
  {
    "title": "LG Apex US740 Android - US Cellular",
    "brand": "LG",
    "image": "imageurl",
    "stock": 3,
    "seller": "60a548b93e6aa47fb3d48160",
    "price": 50.5,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "LG Cosmos Touch VN270 - for Post-Paid Verizon Plans",
    "brand": "LG",
    "image": "imageurl",
    "stock": 3,
    "seller": "60a548b93e6aa47fb3d48121",
    "price": 23.95,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4811d",
        "rating": 1,
        "comment": "This phone does not get decent reception and drops calls constantly. I know it's not the verizon network as this has never happened with any phone I've every purchased from them. I am very dissapointed with this purchase and will never recommend HollyCellular."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48141",
        "rating": 4,
        "comment": "Everything was fine."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ac",
        "rating": 5,
        "comment": "Good phone"
      }
    ]
  },
  {
    "title": "Honor 5X unlocked smartphone, 16GB Daybreak Silver (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d480f1",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48111",
        "rating": 5,
        "comment": "Very Good.Repeat purchase in short time."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48151",
        "rating": 4,
        "comment": "like this phone very and easy to operated"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48178",
        "rating": 4,
        "comment": "Inspite of few bugs and slowness, I like it. Fingerprint recg is superb, overall a nice package."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48163",
        "rating": 5,
        "comment": "Love it!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48175",
        "rating": 5,
        "comment": "Great, sonthing to findou befor you buy is, the speed to write and read from micro SD memory."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48174",
        "rating": 5,
        "comment": "All perfect! I love this phone!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4817c",
        "rating": 2,
        "comment": "This phone is pretty overrated.Cons:1. The stock ROM is pretty awful, and very laggy. Much slower then my old Nexus 4, Nexus 5, Moto 4, Moto X pure. Flashing cyanogenmod is much better, but there is still some lag. Definitely worse then any of my other phones with Marshmallow.2. The phone is quite big.3. No Quick charge on US models4. No NFC or wifi 5g band5. Stock launcher has no drawersPros:1. Nice heavy solid feel2, Good fingerprint sensor"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813a",
        "rating": 5,
        "comment": "I did a lot of research before I purchased these phones (I bought two). The battery life is excellent. The photos are decent. It's reception and functions (especially if you change menu to Google) are great. It is a great value for someone who has to bring their own phone. It looks nice, it's much lighter than other phones but the metal case makes it look pricier. I love the fingerprint unlock. It's location makes perfect sense. When I bought it (in the beginning of the year) I spent hours reading reviews and watching reviews.It was one of the best rated in March 2016 for it's price range. I have not been disappointed."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d8",
        "rating": 5,
        "comment": "This phone is amazing at an amazing price. It actually works better than my Samsung galaxy S4 which I ended up paying nearly $700 for. It is fast, it takes excellent pics, and has a great screen display. Bigger than my S4 for sure. I love it and will buy it again. If you want a quality phone without the expensive price tag, it's a no brainer."
      }
    ]
  },
  {
    "title": "Samsung Ativ S Neo I187 16GB Unlocked GSM 4G LTE Windows 8 Cell Phone - Blue",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d480df",
    "price": 129.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ff",
        "rating": 5,
        "comment": "excelent phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812d",
        "rating": 5,
        "comment": "This phone is everything I wanted. I put in it a Samsung 32 GB card and now I can watch my movies, take great pictures, and video, download all books I want. I also use it for my business processing documents, scheduling, email,etc. Highly recommended!"
      }
    ]
  },
  {
    "title": "Brand New Nokia 201 Pink RM-800 Factory Unlocked US Warranty GSM 850/1900",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480e8",
    "price": 299.0,
    "reviews": []
  },
  {
    "title": "Samsung Alias SCH-u740 for Verizon (Black)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d480b7",
    "price": 72.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480cd",
        "rating": 5,
        "comment": "Great product! The phone was listed in good condition but I was pleasantly surprised by how nice it looked. We had a small issue with the phone not charging and the seller was very quick to respond and fix the problem!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809b",
        "rating": 2,
        "comment": "this refurbished phone has a really low vibration and the condition of the phone wasn't good."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813c",
        "rating": 5,
        "comment": "I had had an Alias (gold) several years ago and loved it, but quit using it when I switched carriers. When I came back to Verzion, I wanted a second line but not the expense of a new phone and was pleased to see that an Alias was a possibility. The battery life is incredible - much better than I remembered and far more than any recent phones I've had. It is a thin, light phone with a two-way flip: one like a normal flip phone, the other similar to a micro-laptop for web surfing (such that it is). Web access is a drawback, due to no fault of the phone. The internet software is no longer supported by Verizon and many web-based features (games, new ringtones, music download, etc) is disables. The very simple web browser still works to date and many sites are still accessible. Another couple minor annoyances: the ring volume is very soft and there is no wi-fi. But it is a very attractive phone and still gets comments; it's surprisingly rugged for a dual-hinge phone and the call quality is superb. In many ways the Alias outperforms newer phones. I'll hang on to this one much longer this time!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d3",
        "rating": 4,
        "comment": "The item arrived in excellent condition even with the plastic still attached to the screen for protection! The only issue was the small size of the Querty keyboard and the smaller screen than what I expected. But the phone was in mint condition. A person with small hands and good eye sight, it's the flip/txt phone for you! I like the idea that it opens two ways for talking and texting versus the slider phones on the market today."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816f",
        "rating": 2,
        "comment": "I have owned this model before and was looking forward to owning it again because it worked great in the past. Unfortunately the charger that came with this one did not work properly and had to have weight put on the charger for it to charge. Even when it was fully charged it did not hold the battery life for long."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480cb",
        "rating": 1,
        "comment": "The first phone could only be used on speaker mode. The replacement phone could not receive picture messages, camera didn't work and the volume control was broken... enough said. Received full refund."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d4",
        "rating": 3,
        "comment": "it's small and easy to carry around; gets great reception; but to answer a call; i have to hold it a certain way or the back pops off and the battery falls out. don't know if it's a defect or what."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812f",
        "rating": 1,
        "comment": "We bought this phone and 1 month later, it started to fall apart. Literally, pieces started coming off and it stopped functioning. This was NOT due to excess wear and tear or use. In fact, it was kept safely on the counter unless someone was talking on it. Beware of this!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809d",
        "rating": 1,
        "comment": "Ordered this phone & accessories as a bundle with VERY expensive 1 day shipping. Phone WILL NOT \"send\" - I can't MAKE calls only receive. Are these new or refurbished? I ordered it as NEW but I don't believe it is."
      }
    ]
  },
  {
    "title": "Samsung B7330 OmniaPro Unlocked GSM Quad-Band Windows Mobile Smartphone with 3.15MP Camera, QWERTY Keyboard, Wi-Fi and Bluetooth--International Version with No Warranty (Black)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d4816d",
    "price": 99.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480af",
        "rating": 3,
        "comment": "Good Phone."
      }
    ]
  },
  {
    "title": "Samsung BlackJack II Unlocked GSM PDA Cell Phone",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 5,
    "seller": "60a548b93e6aa47fb3d4814f",
    "price": 199.99,
    "reviews": []
  },
  {
    "title": "ENV2 VX9100 MAROON VERIZON CDMA NO CONTRACT",
    "brand": "LG",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d480ce",
    "price": 79.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480cc",
        "rating": 5,
        "comment": "Just as described. Super fast delivery. Daughter loves the new phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c9",
        "rating": 1,
        "comment": "I love this phone and had one myself for many years. So when my daughter needed a phone I thought this would be a great one for her since she is too young for a smart phone. However, this is the second phone I have bought from them and BOTH phones stopped working unless they are plugged into the charger. Even with a full battery they still shut off as soon as they are unplugged. VERY frustrating and very disappointed. Also when I received the ENV2 I looked it over and it looks as though it had water damage prior to me getting it."
      }
    ]
  },
  {
    "title": "Microsoft Nokia Lumia 435 8GB Unlocked GSM Windows 8.1 Touchscreen Smartphone Black (International version, No Warranty)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d480b6",
    "price": 48.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480cf",
        "rating": 2,
        "comment": "I will not be returning this item as I previously mentioned. Changed my mind."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48153",
        "rating": 5,
        "comment": "Nice"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815b",
        "rating": 4,
        "comment": "Nice for the price but slow and small."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c8",
        "rating": 5,
        "comment": "Got two for one reason .. It's unlock and my dad and uncle use it .... Lol"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48099",
        "rating": 5,
        "comment": "It's nice and I love it for z price but I brought it for Africa so I will c how it work over there ;)"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ab",
        "rating": 3,
        "comment": "Poor quality and therefore does not my desire"
      }
    ]
  },
  {
    "title": "Samsung B3410 Corby Plus Unlocked Quad-Band Phone with Camera, Bluetooth, FM Radio and microSD Slot--International Version with Warranty (Black)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d48128",
    "price": 99.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480f0",
        "rating": 2,
        "comment": "after a month has problems on the screen, standing on white color, without manipulation"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809e",
        "rating": 3,
        "comment": "Bought this as a phone to have for use during international travel. We travel to Israel regularly as our daughter lives there and decided it would be cheapest to own a phone that we can just buy a Sim card for while there. We figured we could also use it if we travel to other countries. The phone basically worked fine for calls and texting. Nothing fancy. It is not a smart phone, which we knew. It was easy enough to figure out how to use it. Was not crazy about the sound clarity. Would not like it for my regular phone but good if you want a phone for just travel use. Did not want to spend the money for an unlocked smart phone but did miss having one at times to look up things as we were traveling. The phone supposedly had some internet access but I could never access it."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48176",
        "rating": 5,
        "comment": "I bought two of these as gifts for my brothers who do not love an all touch screen phone. I am glad that Samsung still have these sliders.Very happy buyer."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e0",
        "rating": 4,
        "comment": "May not be the greatest phone out there, but at least it does what it says. Have had no problems so far."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814b",
        "rating": 4,
        "comment": "It works well I just don't like where the buttons to receive a call is because often when it is in my pocket I can't get it out without hitting the reject call button"
      }
    ]
  },
  {
    "title": "Apple iPhone 4 16GB (A1332) - GSM Factory Unlocked - No Warranty (Black)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d48100",
    "price": 208.79,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480f7",
        "rating": 2,
        "comment": "Battry was no good some refurbish job"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480fc",
        "rating": 1,
        "comment": "Phone not working"
      }
    ]
  },
  {
    "title": "Apple iPhone 4 8GB - White - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d4817e",
    "price": 179.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48152",
        "rating": 5,
        "comment": "Perfect!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48185",
        "rating": 5,
        "comment": "PHONE WORKED GREAT ,"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48156",
        "rating": 1,
        "comment": "When my phone was delivered to me the home button was broken ."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e3",
        "rating": 5,
        "comment": "It didn't work for me, it was in great shape just didn't work with our plan."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b8",
        "rating": 1,
        "comment": "phone did not work!!!!!!!"
      }
    ]
  },
  {
    "title": "Honor 8 Dual Camera Unlocked Phone 32GB - Pearl White - GSM - US Warranty",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 14,
    "seller": "60a548b93e6aa47fb3d4811c",
    "price": 399.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480b1",
        "rating": 5,
        "comment": "Great phone. now it is time to get rid of iphone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48123",
        "rating": 5,
        "comment": "I'm not a power user, but I needed a phone free of frustrations and the Honor 8 provides."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48181",
        "rating": 5,
        "comment": "Love this phone it is amazing"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d2",
        "rating": 5,
        "comment": "Coming from a Galaxy s6, I expected a major dropoff in quality, but after a couple days with this phone, I am still impressed. I'm in love with the fingerprint button which is super fast, and can actually function as a smart button. The EMUI software takes getting used too, but using a launcher such as Nova fixes most of the gripes people have with this phone.This phone feels like it should be double it's price. Good job Huawei!"
      }
    ],
    "disabled": ""
  },
  {
    "title": "Nokia - 220 Unlocked Dual-Band 850/1900 GSM Phone with 2MP Camera, (RED)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d4813d",
    "price": 179.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4810d",
        "rating": 2,
        "comment": "Comes preloaded with Facebook and Twitter. No way to remove. Also, constructed in a very flimsy way, especially for Nokia.Looks cool and fits comfortably in the pocket."
      }
    ]
  },
  {
    "title": "New Hatsune Miku Limited Edition SO-04e MK (Official unlocked mobile phone) (Limited Green)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d480bf",
    "price": 75.0,
    "reviews": []
  },
  {
    "title": "LG C410 Xpression 2 Keyboard Messaging Cell Phone - Blue (Unlocked) No Contract",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480c9",
    "price": 149.99,
    "reviews": []
  },
  {
    "title": "Brand New Nokia E75-1 Silver Black Factory Unlocked made in Finland GSM phone",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d480d5",
    "price": 299.0,
    "reviews": []
  },
  {
    "title": "Apple iPhone 4 32GB (White) - Verizon",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 1,
    "seller": "60a548b93e6aa47fb3d4816a",
    "price": 115.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480a0",
        "rating": 1,
        "comment": "I've barely owned this two months and it already fails me. The sound/speakers work fine with everything EXCEPT when it comes to notifying me of incoming calls/texts/etc. Oh sure, the alarm works when I need to get up in the morning for work, and for playing podcasts, videos, and music. But what's the point of a phone when a call or text comes in and I have NO idea? Horribly inconvenient. I didn't buy this phone for fun, I need it to COMMUNICATE. This is my first Apple device and truly the biggest regret I've ever purchased. If only my financial situation allowed me to make this right - to buy a new/better phone - but, dang. I'm screwed over and there's not much I can do about it. Thanks Apple."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48187",
        "rating": 5,
        "comment": "Good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480db",
        "rating": 3,
        "comment": "It didn't meet my expectation because it had no sim slot available."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d9",
        "rating": 1,
        "comment": "I hate the iPhone I purchased and am now searching to replace it. I will never buy another iPhone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48177",
        "rating": 1,
        "comment": "Volume would not work..."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Huawei Ascend G730 (White) 5.5\" GSM 3G (Factory Unlocked) Quad Core Android Phone",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 3,
    "seller": "60a548b93e6aa47fb3d48149",
    "price": 110.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48118",
        "rating": 3,
        "comment": "Phone worked well at first. After update network stopped working. This review should be noted by NZ buyers in particular."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48186",
        "rating": 5,
        "comment": "very good"
      }
    ]
  },
  {
    "title": "Honor 8 Dual Camera Unlocked Phone 32GB - Sapphire Blue - GSM - US Warranty",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 1,
    "seller": "60a548b93e6aa47fb3d48135",
    "price": 399.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480e6",
        "rating": 5,
        "comment": "So far this is the nicest phone I've owned. My second Huawei phone and the quality of their products has only gotten better imo. The design and build quality of this phone makes the jet black iphone look ordinary and the battery life makes the iphone look pathetic. I don't mind the EMUI that much, but am a real fan of Google Now, so went straight to that launcher. The settup was pretty easy, though it did not simply mirror my apps and settings from my other phone, so I had to download and install my favorite apps one at a time. Since the phone is so fast, that did not take much time and it gave me the chance to explore settings and features while I was doing the tasks. Camera results are superb though I have much more to learn about the options and features provided. Signal strength for both wifi and network are the best I've had in my rural local. So far I'm totally pleased with this item and found a case I really like, though I'd much rather use the phone without a case. That is not, however, a practical every day option. Drops could be fatal with so much glass exposed. I'll update more here if I change my point of view, but for now this is a winning choice for my needs and taste."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4810f",
        "rating": 4,
        "comment": "finger print magnet."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815c",
        "rating": 5,
        "comment": "Super good. Over my expectation. Excellent call quality, fast web function, very easy to handle, fast charging. I love it. My friends and family and will definitely purchase more."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814e",
        "rating": 5,
        "comment": "awesome phone for the price, a real iPhone7 contender. from the u toob videos i saw, iPhone7 only beat this phone with loading videos and game playing, by just a tad. works just fine on AT&T by me. i have no issues with this item. in my opinion, this phone is 95% of iPhone7 at half the price. in my opinion, the Honor 8 or 5x is good enough for 95% of smart phone users. every product has pros/cons when comparing to other phones. i cant say much about camera quality because that is not what i use the phone for, all i know is, it takes pictures. as for the GUI, seems fine to me. i did also buy Lwang Nillkin glass screen protector and a silicone case to help protect the phone. batt life seems on par with other phones of similar size. since it is Android i do recommend to put on some anti-malware app, i use a paid-for Webroot subscription that gives me anti-malware and ability to manage the device remotely (tracking, lock, alarm, etc etc)."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811e",
        "rating": 5,
        "comment": "very nice, but cannot support dual-sim"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c3",
        "rating": 4,
        "comment": "The Honor 8, beautiful phone in my opinion. It is almost perfect but it's not. There are some technical and physical cons that I'd like to address but first, let's start with the pros.Pros-Gorgeous design. I really like the design of this phone, it's elegant and eye-catching.-Performace, it's really snappy. I love how quick everything loads.-Display, even though I would prefer an AMOLED display, this display is pretty good and can hold it's ground.-Battery Life, it would last my a day and a half of regular use (so mix of youtube, texting, gaming, taking pictures, etc.)-The camera can take amazing pictures but there is a downside.-The phone feels extremely solid in the hand.-Fast charging charges the phone up in about 1 and a half hours.Neutral-EMUI, I personally don't hate it but I wish they would stick with a more traditional android experience. It, however, is annoying that notifications don't show up on the lock screen.Cons-The camera's video capabilities aren't the greatest. It's decent but not great.-This phone uses Gorilla Glass 3 not 4. I wished Huawei would put this in the spec sheet on their website. I had to go ask an agent from Huawei in order to get this information.-I wish this phone uses quick charge 3.0 because there isn't any quick charge battery banks that support this phone which is disappointing.-For me, the GPS is gimmicky when I'm using it for the first few minutes but the problem goes away after those few minutes.-The phone only has 24.06 GB of storage even though it's advertised as 32 GB.Overall, the phone is great. For $322.98, it's a great deal. I got it on Black Friday for $265 with the free Doctor Strange bundle (case is pretty sick). I would recommend this phone to anyone that's looking for an amazing budget phone."
      }
    ]
  },
  {
    "title": "Apple iPhone 3GS A1303 16GB GSM Unlocked SmartPhone - Black",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 5,
    "seller": "60a548b93e6aa47fb3d480d5",
    "price": 33.0,
    "reviews": []
  },
  {
    "title": "Apple iPhone 3GS 16GB (Black) - AT&T MC135LL/A",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d48162",
    "price": 30.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4815d",
        "rating": 1,
        "comment": "The phone does not hold a charge at all.I cant take it off the charger or it will die even when it says 100%"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f5",
        "rating": 5,
        "comment": "So it's not the newest phone out there, so what. This phone was cheaper than getting an iPod of same GB size. It's an apple product so good support, good apps."
      }
    ]
  },
  {
    "title": "Sony Ericsson TM506 Unlocked QUAD-Band 3G GSM Cell Phone",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 14,
    "seller": "60a548b93e6aa47fb3d480f1",
    "price": 173.0,
    "reviews": []
  },
  {
    "title": "Apple iPhone 3GS 8GB Black Factory Unlocked / Not Jailbroken",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 3,
    "seller": "60a548b93e6aa47fb3d480e8",
    "price": 33.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480fa",
        "rating": 1,
        "comment": "When I received the iphone,i found it is fake and inferior product,the back cover is renovated,the receiver has a noise when you have a call,screen light-leaking,in a word,it is a bad iphone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48144",
        "rating": 5,
        "comment": "Yes I like my 3G first I can't connect to Internet but finally I got it and I happy with my selection thank you very much"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48107",
        "rating": 4,
        "comment": "Came in factory box unopened, my niece hasn't had one problem with it. Programmed so easy for her straight talk activation"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48112",
        "rating": 5,
        "comment": "I was using a an old iPhone 3 that a friend gave me and got to really like it. But then I accidentally got a lot of water on it and couldn't get it to work again. I bought another cheap mobile phone and was very dissatisfied with it--I wanted my iPhone back! I thought to look for a used iPhone on Amazon and was delighted to find many 3Gs for sale for under $100.00. It works great so far and I'm happy with it."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480bc",
        "rating": 1,
        "comment": "I received the phone with the \"on\" button missing. I took it into the apple store and they said it was counterfeit and refused to fix it. I contacted the seller but they refused to do anything."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480be",
        "rating": 5,
        "comment": "i got this phone as a gift for my nephew i have had iPhone 3gs before so i know how they work , the phone is in mint condition but did not come with a charger, the phone is factory unlocked as promised and did not ship in the amount of time that it should this is also understandable and acceptable once you use the phone for the first time."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48188",
        "rating": 4,
        "comment": "WORKING NICE AS PER EXPECTATIONS STILL I DID NOT COME ACROSS ALL THE FEATURES IT CONTAINS .PICTURE QUALITY IS EXCEPTIONAL."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b5",
        "rating": 1,
        "comment": "I have trouble with receiving pictures . had to call my cell phone company and Im still having trouble. Its just wasn't what I expected. I also ordered the plastic cover and I still waiting for it. it now been 3 weeks"
      }
    ]
  },
  {
    "title": "Sony Ericsson W508 Tri-band Cell Phone - Unlocked",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d48132",
    "price": 269.1,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "Lumia900 Factory Unlocked Smartphone with Windows Phone 7.5, 8 MP Camera, 4.3-inch Touch Screen, 16 GB Memory and Wi-Fi - No Warranty - Black",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d48114",
    "price": 288.88,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480c1",
        "rating": 5,
        "comment": "This phone is absolutely fantastic for the price, but some potential buyers may not be fully aware of what to expect when it arrives.First off this phone is actually an unlocked AT&T Lumia 900, so there will be AT&T branding on the front. This means that the original packaging will already be opened, as the seller needs to manually unlock the phone before they ship it to you. This does NOT mean that it is a used phone. In order to be able to use non-AT&T sim cards, it is necessary for the seller to contact AT&T to receive an unlock code that frees it from the AT&T network. In my order, there was hardly any sign that it was handled at all, except for maybe a little finger print on the front glass. All the essential documents from AT&T and Nokia were inside the box, as well as a SIM ejector tool and a power cable.As is stated in the description, this phone will work on any HSPA/WCDMA 850/900/1900/2100 MHz/Quad-band data network and any GSM/GPRS/EDGE: 850/900/1800/1900 MHz cellular network, which in turn opens it for carriers in Europe and some in Asia. For US providers, there are currently only 2 major carriers that have GSM networks: AT&T and T-Mobile. There are other smaller carriers that offer services, but they utilize AT&T and T-Mobile towers in their coverage. These carriers include Straight Talk, Red Pocket Mobile, i Wireless, etc., and offer really affordable prepaid plans that I myself utilize. T-Mobile also offers a $30 a month prepaid plan that is rather reasonable.Unfortunately this phone will not work on any CDMA networks, which rules out Verizon, Sprint and US Cellular. For more information on the differences between CDMA and GSM networks, PCMAG.com has a fairly easy to read article explaining the differences between the two.Now onto the phone itself. I must say that I love this phone. It has a fairly decent Amoled 4.3 inch display, with a resolution of only 800x480. In our modern age of 1280×720 and above screens that may seem rather paltry. While using the phone normally it is looks as good as any other screen, but when watching YouTube videos it's lack of pixels becomes apparent. For me I use my iPad and laptop for watching videos so it doesn't matter to me all that much, but for others it may be a deal breaker.The build of the phone is absolutely fantastic. It is made of a solid polycarbonate body that is very resistant to scratches, with a screen made of Corning Gorilla Glass. Needless to say, it is very sturdy. The screen also seems to attract a large number of fingerprints as well, and for some reason is not all that easy to clean off. There is even a YouTube video where a hammer, saw and nail are taken to it and it comes up with little or no damage. The only thing on the phone that seems to be somewhat damageable is the metal piece around the camera lens. After less than 24 hours, there were already little scratches visible. For me I don't really care too much about it, but for others it may be really irritating.The camera itself is 8 megapixels with a Carl Zeiss lens, and it is just ok. There are certainly better phone cameras out there, with the iPhone 5 and Lumia 920 blowing it out of the water. For me it works best outdoors, as indoor shots tend to have more noise for whatever reason.This phone uses Windows Phone 7.5 Mango, so it is not the brand new Windows Phone 8. Sad thing about this phone is that it will never receive an update to Windows Phone 8. The hardware is just unable to fully handle the new OS. Instead it will receive Windows Phone 7.8, which gives it some Windows Phone 8 functionality, such as resizable tiles and the like. But apps in the future will cater just to Windows Phone 8, meaning that those with 7.8 and below will be left out in the cold with newer apps. Again, this isn't a deal breaker for me but for many it will be.One of the things that attracted me to this phone is Nokia Drive. Unlike most smartphone map applications, it does not require data in order to run. Before you set out on a trip you download fully detailed maps onto your phone, and then the built in GPS chip is used to map your location on the map. You can even download state or country specific maps, so you save space by not downloading the entire US map pack. All of this is done without data usage, which is great if you are traveling abroad. Oh, and it is completely free of charge. For travelers like myself, this is an awesome feature. I am also a student, so having a mobile version of Microsoft Office in my pocket is absolutely wonderful, for it allows me to edit documents while on the go.Overall this is a fantastic phone but definitely shows its age (close to one year). However, its awesome build quality as well as fantastic applications for travelers made it a must have for me. It fits my needs well, but potential buyers will need to consider whether it will work well for them."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48113",
        "rating": 5,
        "comment": "i like it it is very nice .very well.a good gift to my friend.it is really very good.the item is nice."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a6",
        "rating": 5,
        "comment": "Just got this phone and all I can say is that it is amazing. People say the camera is one of the weak points. That may be true but I adjusted the settings to 200 for the ISO and 1 for the exposure and the pictures have improved greatly. The simplicity of this phone makes it easy to learn and pick up for anyone. Its a breeze finding things on this phone, no lag, great UI. The live tiles are easy to use and multi-task through. And this phone is blazing fast! enough said."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48096",
        "rating": 3,
        "comment": "Good phone, excellent price. The only problem is the internet sharing because is blocked by AT&T"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f7",
        "rating": 5,
        "comment": "RECOMMENDED SELLER EXCELLENT PRODUCT"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480fc",
        "rating": 4,
        "comment": "does it work in asia?"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48100",
        "rating": 2,
        "comment": "Phone is nice but it is not factory unlocked and I have a lot of problems to have data connection stable in ArgentIna, sometimes work, sometimes do not, then great for who have not a data plan and use wifi but if you one all benefits of the phone take care !!!!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48102",
        "rating": 5,
        "comment": "Bougth this phone for many reasons especially to play the radio. My friend likes it and would recommend to all."
      }
    ]
  },
  {
    "title": "Samsung A157 Unlocked GSM Cell Phone with Internet Browser, 3G Capabilities, SMS & MMS and Speakerphone - Black",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d480c2",
    "price": 249.99,
    "reviews": []
  },
  {
    "title": "Samsung A257 Unlocked QuadBand Phone with QWERTY Keyboard and Camera - Unlocked Phone - No Warranty - Orange",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 3,
    "seller": "60a548b93e6aa47fb3d480e1",
    "price": 16.5,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48124",
        "rating": 3,
        "comment": "IT was everything i expected being an older modle,just what i was looking for a good bang for the buck."
      }
    ]
  },
  {
    "title": "Microsoft Lumia 650 (RM-1154) 16GB White, 5\", Dual Sim, Unlocked International Model, No Warranty",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 5,
    "seller": "60a548b93e6aa47fb3d480bb",
    "price": 127.95,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48150",
        "rating": 5,
        "comment": "so nice"
      }
    ]
  },
  {
    "title": "Huawei Ascend G730 (Black) 5.5\" GSM 3G (Factory Unlocked) Quad Core Android Phone",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d48106",
    "price": 80.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480aa",
        "rating": 5,
        "comment": "love it!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ad",
        "rating": 5,
        "comment": "very pleased with this product which I expected can buy with confidence the team is excellent and again!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811a",
        "rating": 4,
        "comment": "Is'nt 3G or H 1900 band"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815a",
        "rating": 5,
        "comment": "very well. Very fast the entrage"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4818c",
        "rating": 5,
        "comment": "muy bueno"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816c",
        "rating": 1,
        "comment": "Just received the product in Venezuela and went bad, it is a phone I repowered . Would not recommend"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809c",
        "rating": 5,
        "comment": "excelente"
      }
    ]
  },
  {
    "title": "Samsung B2100 Xplorer Anti-Shock Waterproof Unlocked GSM Phone with Camera, Bluetooth, FM Radio and Micro SD Memory Card Slot--International Version with No US Warranty (Red)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d4813e",
    "price": 129.99,
    "reviews": []
  },
  {
    "title": "Galaxy s III mini SM-G730V Verizon Cell Phone BLUE",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d4814d",
    "price": 56.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48109",
        "rating": 3,
        "comment": "Got phone yesterday all is good so far but only problem i can see is that the charging cable that came w the phone literally came apart in my hands this morning, leaving the metal piece in the phone! Got it out and replaced the cable so hopefully the hubby will be pleased now!"
      }
    ]
  },
  {
    "title": "New Unlocked Nokia 6110 Navigator with Free Car Charger",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d480ca",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48126",
        "rating": 5,
        "comment": "Thanks and good agent"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48134",
        "rating": 1,
        "comment": "the phone was not newit is used ."
      }
    ]
  },
  {
    "title": "Galaxy S5 G900A Factory Unlocked Android Smartphone 16GB White",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d480ed",
    "price": 222.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480a7",
        "rating": 5,
        "comment": "LOVE IT, IT BIG AND BOLD"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48127",
        "rating": 5,
        "comment": "Great!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48154",
        "rating": 3,
        "comment": "The phone works good but sometimes I don't get service."
      }
    ]
  },
  {
    "title": "Nokia - 106.3 Negro/black Unlocked Dualband GSM 850/1900",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d480c5",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48093",
        "rating": 5,
        "comment": "Within its limits its a very capable little device. It's very inexpensive, the battery lasts incredibly long, the voice clarity is great, and it has excellent reception. Back in 2003-2007 this device would have been a bestseller. After breaking my smartphone I bought this as a backup,"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48095",
        "rating": 4,
        "comment": "It is a less-tan-30-dollar-non-contract-phone. What can you say. Perfect for Water White and Jessie Pinkman."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48159",
        "rating": 3,
        "comment": "Very light phone good for Sameone who is not into smart phones"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a2",
        "rating": 4,
        "comment": "GREAT tough little backup phone to have around when your fragile smartphone breaks. Battery lasts for days. No camera, bluetooth or pc connectivity, but you can make calls and text. Also has an FM radio on it, but unfortunately you can't use just the radio without a sim card in it."
      }
    ]
  },
  {
    "title": "Huawei Ascend M860 Cricket Touchscreen Android Smartphone - NICE",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480a7",
    "price": 18.88,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48116",
        "rating": 4,
        "comment": "Very cool phone just wished that it worked in our area. They were very quick to get it here and was very good about taking it back when it did not work in my area"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48179",
        "rating": 1,
        "comment": "The Internet connection was broken I couldn't get on any apps or internet. I tried several times to get it placed"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ef",
        "rating": 1,
        "comment": "This phone, just like most cricket wireless phones, are no good!! This one is poor quality and cheap material. I purchased it for my mom. She had the phone for a few months. The screen kept freezing, the phone turned off without warning on a full battery, it says it charging when its not, and worst of all the mouth piece sometimes doesn't work, so she can't even talk on the darn thing. After the phone wouldn't charge we recycled it. It should've receive a rating of negative 5!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c6",
        "rating": 1,
        "comment": "has not been a good phone,but use untell i get another one ........and be see big u the tree on"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48110",
        "rating": 1,
        "comment": "The phone is a metro pc phone the internet takes for ever to work when it actually dose work My old busted phone operates better then the new one I got..."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811b",
        "rating": 1,
        "comment": "good afternoon, the phone \"Cricket huawei\" brings no sim card therefore is inservirble in my country Venezuela, I would like to make a product change that I get my hands three days ago. find out and the cell can not be placed online and the wifi does not help, thanks in advance."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48171",
        "rating": 2,
        "comment": "Easy to use. However, the battery has no life and it randomly shuts off and is really slow. Not a phone I would recommend."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48109",
        "rating": 2,
        "comment": "When I received the phone it was in really good condition and it arrived on time. After using it for about 2 weeks it started turning off in the middle of conversations, and the web browser is horrible. If you can get a different phone, I suggest you do that."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814d",
        "rating": 1,
        "comment": "I bought this as a gift for a friend and sent it directly to her.My friend received a phone with a defective charging port, that renders the unit unusable since it can not charge the battery.I wander, is this a new phone?"
      }
    ]
  },
  {
    "title": "Galaxy S6 Active - Camo Blue (Unlocked)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480a5",
    "price": 222.0,
    "reviews": []
  },
  {
    "title": "\"Nokia Asha 302 Unlocked GSM Phone with 3.2MP Camera, Video, QWERTY Keyboard, Wi-Fi, Bluetooth, FM Radio, SNS Integration, MP3/MP4 Player and microSD Slot - White International Version/Warranty",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d480b5",
    "price": 299.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480fd",
        "rating": 5,
        "comment": "Phone is working on, I was planning to use it for whatsapp anyway. The oh problem, I can't change the idiom"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480fa",
        "rating": 5,
        "comment": "excellent product in perfect condition"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48144",
        "rating": 5,
        "comment": "excellent"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48107",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48112",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480bc",
        "rating": 2,
        "comment": "I like these phone I bought it for my mom and she loves it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480be",
        "rating": 2,
        "comment": "It came with arabian keyboard :("
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48188",
        "rating": 3,
        "comment": "I love the phone, but one problem and one problem only............once the mic goes that's it. No more mic. But it can take a beating."
      }
    ]
  },
  {
    "title": "Apple iPhone 3G 8GB (Black) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 11,
    "seller": "60a548b93e6aa47fb3d48108",
    "price": 24.6,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480bd",
        "rating": 3,
        "comment": "Average quality"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48122",
        "rating": 1,
        "comment": "I was looking for it to be bigger"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b2",
        "rating": 5,
        "comment": "Excellent, fast, delivery."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b9",
        "rating": 5,
        "comment": "Love it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4810c",
        "rating": 4,
        "comment": "I just got my phone and plugged it in the charger sent and it wouldn't work. Plugged it in with my charger for my current iPhone 3GS. Still wouldn't charge then finally plugged it into my ihone and it started charging. The phone was completely dead when I got it and has finally come on so I know it at least works how well I'm not sure as I am waiting for it to charge completely. It did not come in a box like they said but that's ok I already have an iPhone box as I bought mine new for $1.06 when I signed on to my 3 year contract. At that time the phones had just come out. Ill update my listing once I mess with the phone. There were light scratches on the back but nothing gastly just normal wear."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d0",
        "rating": 5,
        "comment": "I love this phone but, somebody stole it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814f",
        "rating": 1,
        "comment": "Disappointed in the phone"
      }
    ]
  },
  {
    "title": "\"CLEAR CLEAN ESN\" Sprint EPIC 4G Galaxy SPH-D700*FRONT CAMERA*ANDROID*SLIDER*QWERTY KEYBOARD*TOUCH SCREEN",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d4809c",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ad",
        "rating": 5,
        "comment": "I feel so LUCKY to have found this used (phone to us & not used hard at all), phone on line from someone who upgraded and sold this one. My Son liked his old one that finally fell apart after 2.5+ years and didn't want an upgrade!! Thank you Seller, we really appreciate it & your honesty re: said used phone.I recommend this seller very highly & would but from them again!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811a",
        "rating": 4,
        "comment": "nice phone, nice up grade from my pantach revue. Very clean set up and easy set up. never had an android phone but they are fantastic to say the least. perfect size for surfing and social media. great phone samsung"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815a",
        "rating": 5,
        "comment": "Very pleased"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4818c",
        "rating": 4,
        "comment": "It works good but it goes slow sometimes but its a very good phone I love it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816c",
        "rating": 4,
        "comment": "Great phone to replace my lost phone. The only thing is the volume up button does not work, but I can still go into settings to adjust. Other than that, it does the job until I am eligible to upgrade my phone again.Thaanks!"
      }
    ]
  },
  {
    "title": "Honor 5X Unlocked Smartphone, 16GB Dark Grey (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d480a3",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480eb",
        "rating": 4,
        "comment": "price vs performance is very good."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48142",
        "rating": 3,
        "comment": "arrived in 100% flawless condition.BUT the phone design is terrible, the software to be exact is just plain horrible and can only be a 5 star phone if deleting the entire OS to put a basic android on there. The current OS is heavily customised by Huawei and it runs slower than my galaxy S2 from the stone age, my experia Z from the stone age is also better than this, and my zte zmax first gen runs circles around the honor 5x, what were you thinking Huawei???? what, wasted that hardware on poor software, not a smart move."
      }
    ]
  },
  {
    "title": "Apple iPhone 4 16GB (Black) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 1,
    "seller": "60a548b93e6aa47fb3d4814a",
    "price": 208.79,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48102",
        "rating": 5,
        "comment": "I got this phone for my grandaughter for Christmas. She loves it!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48114",
        "rating": 5,
        "comment": "thanks"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48150",
        "rating": 5,
        "comment": "perfect"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480bb",
        "rating": 1,
        "comment": "this phone was sold as new worked for 3 mnths then stopped took it to the nearest apple store which was 3 hrs away for them to tell me it was a \"frankinstien\" meaning there were some apple parts an some that were not now NOBODY will help 300$ just gone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48140",
        "rating": 2,
        "comment": "It's not bad for the price, but there is lots of glitches in it! Another thing, it says it comes with a charger and it didn't! The only thing good about it is that it came quick!!"
      }
    ]
  },
  {
    "title": "Samsung BlackJack II SGH-I617 Unlocked GSM PDA Cell Phone - Bluetooth, 3G, 2.0 Megapixel Camera, microSD Slot, White/Blue",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480d0",
    "price": 199.99,
    "reviews": []
  },
  {
    "title": "Apple iPhone 3GS 16GB (White) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d480fd",
    "price": 53.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48098",
        "rating": 1,
        "comment": "Horrible . This was the worst iPhone I've ever bought . I couldn't even connect to MY wifi in the set up . Total waste of money ! The screen was shattered and I couldn't even get past the set up . Don't waste your time with this seller ! Just buy an iPhone 5s at Walmart on Straighttalk for $199 !"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f3",
        "rating": 1,
        "comment": "I ordered the phone as a bday gift for my son. It got here on time but the battery in the phone was defective. The phone would die completely if the phone's battery reached half-life. I contact the company to get a battery. Living overseas it is not easy replacing a battery for this model and when I purchased it I thought I was purchasing a \"working\" iphone. That was four months ago with no response from the company. Last week the phone did one better, it stopped charging completely and the touch screen literally exploded from the inside out. Although this phone has been in a draw in a protective case for a month when my son was no longer grounded we gave it back to him the touch screen as completely disconnected itself from the phone while the body of the phone was still in the protective case. My son tried to press the screen back into the body of the phone and then the screen cracked. This was a waste of money and time he never got a full months use out of the thing, we were better off just buying him a cheap prepaid phone at least it would have worked."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48147",
        "rating": 3,
        "comment": "ok i guess."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ec",
        "rating": 1,
        "comment": "This was the product description 3.5\" display screen, the iPhone 3GS 16GB smartphone gives you a clear view of all the contents and applications. The Wi-Fi connectivity allows you to chat with friends, view your mails, and surf from almost anywhere. The 3.2MP camera lets you capture your favorite moments with amazing clarity. This iPhone features 600 MHz ARM Cortex A8 processor that lets you easily operate various applications at the same time. The 256MB RAM rapidly processes all your files and data.You cannot connect to wi-fi, you guessed it no Wi-Fi connectivity.The iphone did not come with cables, you guessed it, the customer did not said the item will be missing cables."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48139",
        "rating": 1,
        "comment": "purchased this phone from Ross Cellular via Amazon last May. Has had problems for a couple of months now and is officially broken now. Do not recommend."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48164",
        "rating": 3,
        "comment": "Very cool phone to have for collection"
      }
    ]
  },
  {
    "title": "Apple iPhone 4 A1332 32GB Black (GSM Unlocked)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d4810e",
    "price": 75.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ca",
        "rating": 5,
        "comment": "It was what I was looking for in a Phone thanks for the music. I was Happy with the phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48093",
        "rating": 5,
        "comment": "Phone was in near perfect shape and it came with accessories. Phone works great. If your looking for a phone I would recommend this place."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48095",
        "rating": 5,
        "comment": "they arived in time in APO adress-Afghanistan its nice to buy used iphones when they are in good care,without problems,working perfect,recived as described"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48159",
        "rating": 2,
        "comment": "The phone had been opened. 3 Screws missing along with wifi connector clip and antenna clip under battery connector miss placed. Result little wifi connect ability. Hidden damage."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a2",
        "rating": 1,
        "comment": "I bought because It said that It was unlocked but It wasn't. Now I am in my country, Ecuador and It doesn't work so it is not open to use it worldwide.DON'T BELIEVE THIS GUY !"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c5",
        "rating": 5,
        "comment": "this product seems to be brand new have no problems with the phone at all no scratches or dents very happy with it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4810d",
        "rating": 1,
        "comment": "If everything you ship is like this than i will advise everybody to not buy from you. I got this phone and about a day after it started to break. The third day one of the speakers went out, the next the lock button got stuck and no longer works. now the home button barely works, i have to push certain areas for it to even respond. Im pretty sure the rest of this phone is going to fail at some point, thanks for wasting my money"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813d",
        "rating": 5,
        "comment": "When I received this iphone 4 it was in great condition, but it somehow slipped through the cracks and the unlock and updated os was not completed. I found this out when I tried to have a prepaid service turned on and shelled out $60 for a chip that was nonrefundable. I was furious, I expected the worst to try and resolve this issue, but when I emailed him on Friday night about 6 pm western time he responded within 20 minutes. He apologized profusely and talked me through how to finish the unlock and update til 11:30. then when I installed my new chip it works fine and has been fine ever since I would definitely recommend and buy from this seller again. Things happen and he stood behind his product well past regular business hours."
      }
    ]
  },
  {
    "title": "Samsung Behold SGH-T919 GSM 3G Global 5MP Cell Phone T-Mobile",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d48125",
    "price": 18.88,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48165",
        "rating": 5,
        "comment": "all right!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4810b",
        "rating": 4,
        "comment": "It came good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a4",
        "rating": 1,
        "comment": "I got the phone and put in my sim card and it doesn't work. I will never buy a phone online again"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48167",
        "rating": 2,
        "comment": "When I first bought this phone, problems were already arising. Every time I receive a phone call, my screen is black, does not show who is calling. It'll say your text has been sent, but the receiver will tell you they didn't receive anything. When the texts actually do send, the texts are combined with previous messages from months ago. This phone is messed up in every single way. I do not recommend it."
      }
    ]
  },
  {
    "title": "Huawei Ascend G300 Unlocked Phone - U.S. Warranty (Silver)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d4816b",
    "price": 206.94,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48145",
        "rating": 1,
        "comment": "I always like to give a product some time before I write a review on it. It's been 8 months since I bought this phone. I hate it. The power button works only sometimes. So, there will be times when you can't turn on the phone and cannot make a phone call. If you are in an emergency, you won't be able to reach anyone and you may die because of that. The phone, when it can be turned on, takes FOREVER to load a webpage. The touch screen is not sensitive. The battery needs to be recharged every day even if you don't use the phone. You will have many dropped calls. When the phone thinks you have talked enough, it will cut off your conversation and you have to call again to continue your conversation. Language input methods includes only English and Spanish. The picture of the phone on Amazon doesn't show the back of the phone. I thought it was all silver, but the back of the phone is white. The earphones broke within a week. These are enough reasons for you to not buy this phone. I have had enough and decided to write a review on it."
      }
    ]
  },
  {
    "title": "Huawei - Ascend G610 (Black) 3G 850/1900/2100Mhz, 5.0\" Display, Android 4.2 Quad-core 1.2 GHz, Dual cameras (Black)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 1,
    "seller": "60a548b93e6aa47fb3d48166",
    "price": 90.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4812e",
        "rating": 5,
        "comment": "excelent product"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48182",
        "rating": 5,
        "comment": "fine"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48136",
        "rating": 5,
        "comment": "Excelent"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48173",
        "rating": 5,
        "comment": "excelente"
      }
    ]
  },
  {
    "title": "Apple - Iphone 5c A1532 Verizon 16 GB Cell Phone - White",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480f2",
    "price": 139.95,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48128",
        "rating": 5,
        "comment": "Great phone greAt condition had a great experience and will be ordering from them again if ever need a new phone thank you"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480af",
        "rating": 5,
        "comment": "Great doing business with this seller super good deal quality products thank you"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816d",
        "rating": 5,
        "comment": "I bought this for my wife for her birthday and she loves it hasn't had any problems with the phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480dc",
        "rating": 5,
        "comment": "Product arrived quickly, as described. Defective charging cable replaced immediately when contacted."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a9",
        "rating": 2,
        "comment": "This may seem really ridiculous but I ordered this last week and got it Saturday. Before I got it activated the other night the screen was messing up on me. I was having a lot of fun trying to put in my WiFi information. Anyway, I got it activated last night and everything was working fine. But now it's back to the way it was before it was activated. The screen was acting like it was possessed or a chipmunk on rd caffeine. It kept going to comments or my messages or previous pages on the Facebook app and it even did it on the Safari app when I decided to just use Facebook on that. Still acted up. I was really looking forward to trying out Apple but I'm really disappointed. Even with that 9.0.2 update or whatever it is, it's still doing it. The phone itself is great but that touchscreen thing, REALLY needs to be fixed. As well as on their future models. The only other positive thing I can say is that it finally showed my music than my previous phone did (not an iPhone). It would show less than half of it even though it was all right on the micro SD card I had in it.I will try Apple again someday when it gets better hopefully. If not, it's either just not meant for me, I got a lemon, or I should just curse the fact that I have big fingers. Lol."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813b",
        "rating": 1,
        "comment": "I bought this for my daughters birthday gift. I am having to send it back the day after her birthday. The screen backlight is jacked up. The touch screen does not work. I cannot even slide to unlock the phone because the screen won't work. Totally pissed and disappointed this is total bulls*** that i paid almost $200 just to have to return it and not to mention the sadness of my child that I am returning her birthday gift, and now have to wait to send this one back..... get credit...... order another...... wait for it to come in.....Waste of time and money."
      }
    ]
  },
  {
    "title": "Samsung A777 Unlocked Phone with 3G Support, 1.3MP Camera, Bluetooth and GPS - US Warranty - Red",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d480fb",
    "price": 59.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480c4",
        "rating": 5,
        "comment": "Love the fact that I can swap sim cards and have a phone that works in Europe. Didn't even have to unlock it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48161",
        "rating": 1,
        "comment": "Product looked good but wouldn't work properly at all. Service was mostly not there. Not the area or the service. It's the phone."
      }
    ]
  },
  {
    "title": "Microsoft Nokia Lumia 640 LTE RM-1072 8GB 5\" Unlocked GSM Windows 8MP Camera Smartphone - Black - International Version No Warranty",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d480a0",
    "price": 77.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48130",
        "rating": 5,
        "comment": "FAst shipment and phone was even better than described. Very very happy ty!!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815f",
        "rating": 3,
        "comment": "Not bad"
      }
    ]
  },
  {
    "title": "Samsung Behold T919 Unlocked Quadband Phone with 3G Support, GPS and 5MP Camera - US Warranty - Rose Pink",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d4814c",
    "price": 18.88,
    "reviews": []
  },
  {
    "title": "LG A340 AT&T Cell Phone / No Contract Ready To Activate On Your AT&T Service",
    "brand": "LG",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d480de",
    "price": 50.5,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "4G Huawei Honor 6 Plus PE-UL00 FNC 3GB+16GB 5.5 inch FHD EMUI 3.0 (Android 4.4) Smart Phone Octa Core Hisilicon Kirin 925 1.8GHz 3600mAh Dual SIM FDD-LTE WCDMA GSM (White) (International Version)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d4810e",
    "price": 179.1,
    "reviews": []
  },
  {
    "title": "Apple iPhone 4 32GB (Black) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d48099",
    "price": 99.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48129",
        "rating": 5,
        "comment": "Perfect!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b4",
        "rating": 5,
        "comment": "I still use it, works great"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480cf",
        "rating": 4,
        "comment": "Phone as arrived better condition than description. Happy :)"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48153",
        "rating": 3,
        "comment": "thak you"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815b",
        "rating": 5,
        "comment": "Arrived in condition as advertised. I did not have any problems with upgrade. Works and looks great."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c8",
        "rating": 5,
        "comment": "We had a question about the iPhone and the dealer got back with us the same day we asked. They explain to us some items about the iPhone and our grandson is very satisfied with his new phone."
      }
    ]
  },
  {
    "title": "Samsung BlackJack II I617 Unlocked GSM Phone with QWERTY Keyboard, WM6, GPS, 2 MP Camera and 3G Support (Red)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480ea",
    "price": 19.95,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480fe",
        "rating": 1,
        "comment": "No comment"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48117",
        "rating": 5,
        "comment": "Thank You for a very nice and clear viewing phone that works well with the clear understanding of what a small piece of equipment should work !!!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48168",
        "rating": 1,
        "comment": "I have had two of these phones, l loved the first one but dropped it breaking the s speaker. The new . One worked fora month then would not work, seems as if s speaker went out? Not tech support from Canadiancompany"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48137",
        "rating": 1,
        "comment": "Got this item, worked one time, then nothing, phone will not charge or stay on keeps flashing on and off"
      }
    ]
  },
  {
    "title": "Honor 8 Dual Camera Unlocked Phone 32GB - Midnight Black - GSM - US Warranty",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d48184",
    "price": 399.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480b3",
        "rating": 5,
        "comment": "So I'm kind of a gear nut, in the last 2 years I've gone through: HTC One M8, One Plus One, LG G4, Nexus 6P and now the Huawei Honor 8. My first foray into the Huawei product line was the 6P and honestly I was pretty impressed at what has been coming out of China with regards to affordable Android Devices.Let's get one thing straight, this is an iPhone 6 rip off ALL DAY LONG. From the design of the phone, to the look and feel of the OS, this thing stops just short of saying iPhone on the back. That said, the design is super clean, the back glass looks amazing and the phone is quite the little performer. I've been using this as my daily driver and the performance of the camera is really what sets this device apart from the other phones I've carried. The quality of images in good lighting conditions is phenomenal, especially when I consider I only paid $350 for the phone. Applications are snappy and function just as well as on my Nexus 6P, although I don't game much so YMMV. You can find reviews all over YouTube for this phone that will tout all the goods and bads, and I will say there are some weaknesses, lack of T-Mobile WiFi support is my only real disappointment!Battery life is great, especially for a 5 inch phone. The included quick works great, although it would have been awesome if it supported Qualcomm quick charging! Fingerprint sensor is actually faster and more responsive than my Nexus 6P and my wife's iPhones 6 & 7. If you're looking for an inexpensive 5 inch phone that has an amazing camera and performs well, check out the Honor 8."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f4",
        "rating": 5,
        "comment": "Brilliant phone.Somewhat clumsy software optimizations create actual usable battery life. Last 3 phones would get 1.5-3 hours SOT at most (Note 3, G4, S6). This phone gets 4-6 hours SOT.Nice screen.Great updates so far. On the 9/1/16 security patch as of mid-October, with 2 OTA updates in past 3 weeks.USB-C is much nicer ergonomically than microUSB.Works out of the box with Cricket and Straight Talk.Only downside right now is limited case availability. None from major case vendors right now. Using the OEM clear case, which is too minimalist for my tendency to drop the phone every now and then."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809a",
        "rating": 5,
        "comment": "I got this phone as a temporary phone after Samsung recalled my galaxy Note 7. Amazon had a deal for Colombus day -$50 so I got this for $350. I was blown away with the look of the glass casing. It is a beautiful phone. The futures are great also. Just got to get used to huawei's os. This phone is definitely worth the price!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48132",
        "rating": 5,
        "comment": "Good smartphone in $400 range"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4818a",
        "rating": 5,
        "comment": "Phone is a great size. Very responsive and quick. Battery life is also great. The display is nice to look at. Only issue I had was I wasnt getting all my notifications. I learned you have to mess with the battery settings when you get it out the box. Not a big deal at all. The pictures this phone takes are amazing. Gives you the boken effect experience that the Iphone 7 Plus promises with a update."
      }
    ]
  },
  {
    "title": "New Genuine Nokia X3-00 Unlocked GSM X3",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d480b8",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48156",
        "rating": 5,
        "comment": "I bought this for my mom because she doesn't like Smartphones, and this is the perfect cellphone for her. Recommended."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e3",
        "rating": 2,
        "comment": "actual phone too smallwhile I checked the details before purchase, the actual phone was small ( too small) for me.the return efforts are not worth it. I would rather make a gift of the phone to a younger personwho can better handle this size of a mobile phone"
      }
    ]
  },
  {
    "title": "Samsung C3050 Quadband GSM World Cellphone (Unlocked)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d48164",
    "price": 47.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ec",
        "rating": 4,
        "comment": "Has been suing it overseas for few years now"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48139",
        "rating": 5,
        "comment": "I bought it and i like it.Fits any place and easy to carry.Working well and so far no issues with it."
      }
    ]
  },
  {
    "title": "Apple iPhone 4 16GB GSM Unlocked 1GHz Cortex-A8 SmartPhone w/ 5MP Camera - Black",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d48101",
    "price": 79.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4811f",
        "rating": 5,
        "comment": "good"
      }
    ]
  },
  {
    "title": "Lumia 625 Windows Phone (Unlocked, 8GB, White)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d4818b",
    "price": 299.0,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "LG Chocolate Touch VX8575 3G CDMA GPS Phone Verizon",
    "brand": "LG",
    "image": "imageurl",
    "stock": 11,
    "seller": "60a548b93e6aa47fb3d480e2",
    "price": 16.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480d4",
        "rating": 5,
        "comment": "I just bought this and I am very happy with it . I love LG products. Would definitely buy more ."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812f",
        "rating": 5,
        "comment": "I really like my phone and appreciate the inquiry. I would definitely recommend this phone and actually already have.Is there a case available for this phone?Sonny Christensen"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809d",
        "rating": 1,
        "comment": "I Got this phone for my wife, ever since it has been activated I have had maybe 2 full conversations with her on it. All other calls have been dropped for reception issues and I know its not Verizon because my phone never drops calls."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b7",
        "rating": 2,
        "comment": "Phone is good cosmetic repair overall price great.. No mention the speakers do not work on the item ;(. Would not purchase again"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812b",
        "rating": 5,
        "comment": "Exactly what I hoped! Brand new, in the box, with charger and all protective stickers intact. I was able to transfer everything except calendar reminders from my old phone to the new one in just a few minutes! I've had it almost 2 months now with no problems!"
      }
    ],
    "disabled": ""
  },
  {
    "title": "Cricket Samsung Galaxy Discover R740 Phone",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d48171",
    "price": 24.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48186",
        "rating": 5,
        "comment": "Good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48149",
        "rating": 5,
        "comment": "she liked it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48116",
        "rating": 4,
        "comment": "GREAT BUY!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48179",
        "rating": 1,
        "comment": "This product never worked I charged it all day an still it never came on"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ef",
        "rating": 5,
        "comment": "My step son loved it. Thanks he had lost his phone and we was not going to buy a 13 yr old a $600. Phone. This work out great."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c6",
        "rating": 1,
        "comment": "This phone sucks Its a basic smart phone for beginners I hate it you cant do really anything on it but like talk and text if you try to download an App it takes like an hour to download and to go online its super slow picture quality is horrible and there is no flash on camera I would never recommend this phone to anyone unless its for a child!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48110",
        "rating": 3,
        "comment": "The phone is good i like it. But when i Skype the front face camera does not work i can't see anything out of it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811b",
        "rating": 5,
        "comment": "PERFECT"
      }
    ]
  },
  {
    "title": "Microsoft Nokia Lumia 950 XL RM-1116 (Factory Unlocked) Dual SIM 5.7\" 32GB 4G GSM International Version No Warranty (White)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d48185",
    "price": 381.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48187",
        "rating": 5,
        "comment": "Good product, if you are on Microsoft's platform."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480db",
        "rating": 4,
        "comment": "Great phone. Camera is fantastic. Tile user interface allows the user to quickly see information such as news, weather etc. without opening the app. It also runs very smoothly. I also like the feature where it shows very short clip when you view the picture you take. The iris scanning to access the phone without entering the PIN is cool (need to 'train' it in various lighting conditions to improve the recognition, however). Great phone if you don't need all the apps."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d9",
        "rating": 5,
        "comment": "The best phone that I have had. Excellent camare, excelent design I'm so happy"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48177",
        "rating": 4,
        "comment": "ok"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816a",
        "rating": 1,
        "comment": "Everything is good with this device except for the battery it dies in just under two hours if I am playing music. I upgraded from a Lumia 640XL which is a 3000mAh and this Lumia 950XL I k ow has a 3300 or higher mAh and it takes forever to charge for it to die quick. Even when not in use it dies I have to constantly have charging. I am very disappointed in this device I hate Android and ios have no choice but to get rid of this one and go back to my 640xl"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48152",
        "rating": 5,
        "comment": "The camera is astounding, Windows 10 mobile is a great os"
      }
    ]
  },
  {
    "title": "Apple iPhone 4 - 8GB, BLACK, Net 10 Ready, USE VERIZON'S NETWORK!",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480a6",
    "price": 208.79,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4818b",
        "rating": 4,
        "comment": "So far the iPhone 4 from this seller has been working as promised."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c1",
        "rating": 1,
        "comment": "It didn't come with all the things it said was with the phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48113",
        "rating": 1,
        "comment": "Net10 does NOT support this phone...I have no idea what they were thinking...had to go to verizon...love the phone...hate verizon..Not happy!"
      }
    ]
  },
  {
    "title": "LG 240 FLIP UNLOCKED QUADBAND GSM CAMERA MEMORY CARD CELLPHONE. WORKS ALL OVER THE WORLD",
    "brand": "LG",
    "image": "imageurl",
    "stock": 14,
    "seller": "60a548b93e6aa47fb3d48143",
    "price": 69.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4815e",
        "rating": 1,
        "comment": "I bought the LG 240 phone for my dad who lives overseas and when he put it to charge it did not charge. It could be the battery, Don't waist your $40+ on this phone. And the seller says that they test them before it leaves the factory, I was literally call a lier. I still going to see if I can get it back to return it."
      }
    ]
  },
  {
    "title": "Sony Ericsson Unlocked Vivaz U5 U5i (Blue) Unlocked, International Version with No Warranty",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 2,
    "seller": "60a548b93e6aa47fb3d48094",
    "price": 136.5,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48131",
        "rating": 5,
        "comment": "5 star,I love it."
      }
    ]
  },
  {
    "title": "Samsung B2100 Unlocked Quad-Band Phone, Extreme Anti-Shock, Waterproof, Built-in Flashlight, Bluetooth-International Version-Black",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 11,
    "seller": "60a548b93e6aa47fb3d480d1",
    "price": 129.99,
    "reviews": []
  },
  {
    "title": "Nokia N97 Unlocked Phone with Touchscreen, 3G, 5 MP Camera, A-GPS, 32 GB, MicroSD Slot, and Integrated Ovi Applications--U.S. Version with Warranty (White)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d48163",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48097",
        "rating": 4,
        "comment": "Tengo una semana de estar utilizando este teléfono celular. Es mi primer Nokia y al principio fue un poco frustrante por que no sabía donde buscar las aplicaciones, yo estaba acostumbrado a los celulares Sony Ericksson y me sentía muy cómodo con ellos pero por las características que presentaba el N97 su gran cantidad de memoria ser de tecnología 3G, los buenos comentarios que había escuchado y por precio decidí comprarlo en lugar de un Sony Ericksson.Como mencioné al principio me frustré pero era mas por desconocimiento que otra cosa por ejemplo le instalé el navegador Opra mini ya que el navegador que el trae no me gustaba pero cuando me conectaba a Internet lo hacía atravez del navegador predeterminado y yo no sabía que tenía que entrar a aplicaciones y de ahí accesar a Opra. Pero poco a poco fui encontrandole las aplicaciones y debo decir que ahora estoy muy contento.Las cosas buenas de este celular:1) Esteticamente es muy lindo, la resolución de la pantalla hace que las imágenes se vean muy nítidas.2)La cámara y el video no tienen nada que envidiarle a un artefacto dedicado es decir a una cámara digital o a una videocamara, las fotos son muy bien logradas y el flash realmente funciona en lugares oscuras se pueden apreciar perfectamente los detalles.3) La conexión a Internet es muy buena, gracias al zoom puedes agrandar o disminuir la imágenes las cuales se aprecian muy bien, logicamente hay páginas que por ser tan grandes no se observaran como en la computadora, pero en realidad la navegación es placentera siempre y cuando no tengas que estar digitando algo.4) Conectarte a las redes sociales o a tu correo electrónico esta a un click de distancia y como dige antes en segundos y puedes leer archivos en formato de word excel o PDF. Es decir si no estas cerca a de una computadora no hay ningún problema te sacará del apuro, aunque repito la experiencia aun no es como con la computadora pero ese es un problema en todos los teléfono inteligentes. Yo reviso mis estados de cuenta, puedo hacer una compra en Amazon pagar recibos entrar al banco hacer transacciones, etc, etc.5) El teléfono es robusto se ve fuerte aunque aun no se ha llevado ningún golpe6) Tiene todas las funciones de los teléfonos convencionales pero a diferencia de otros estas realmente cumplen por ejemplo si tienes una grabadora tu esperas que cuando des click esta realmente grabe y esta lo hace, yo he tenido telefonos que cuando quise usar la grabadora esta simplemente no funcionó. Puedes vivar con ello pero da cólera que una aplicación no funcione como debiera.Pero bueno no todo es perfecto y lo que no me gustó es lo incómodo que resulta a veces el teclado qwerty a veces cuando estoy navegando si por alguna razón tengo que digitar algo puedo desplegar texto en pantalla pero en otras ocasiones esta característica no esta disponible y me obliga a usar el teclado y no se si es la falta de costumbre pero soy mucho mas diestro con las teclas de un teléfono que con este tipo de teclado y me demoro mucho por lo que me resulta engorroso. Pero bueno no se talvez dentro de unos meses ya me halla acostumbrado.Pero por lo demás creo que son mucho mas las satisfacciones imaginense pueden utilizar este teléfono como un GPS yo en la particular no lo uso por que ya tengo un Garmin que es una belleza y al cual ya estoy super acostumbrado pero bueno esta es una aplicación que bien vale la pena utilizar si esta disponible. En sintesís le digo comprelo no se va a arrepentir, a y se me olvidaba la pantalla táctil funciona a las mil maravillas esta era una de mis principales dudas, pero me di cuenta que si funciona y excelentemente bien, el secreto es calibrarla la pantalla a tu gusto, si gustas de apretar mucho el lápiz pues así la calibras a mi me gustan los trazos suaves y así la calibré y apenas dejo caer el lápiz y la función se aplica. Así es que es una buena inversión la única razón por la que no le dí cinco estrellas fue por la razón del teclado por lo demás no hay quejas."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ba",
        "rating": 4,
        "comment": "Big and heavy. It is difficult to configure access to web. Excellent sound and screen resolution."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48103",
        "rating": 2,
        "comment": "This is an expensive phone with three major problems for which I gave it a two-star. First, the reception is much weaker comparing to my old phone (Motorola Ming). Once the reception is lost, it could take a minute or more for you to be able to see some signal bars appeared again. Second, the connection is another issue for this cell phone. It gives a lot of \"connection error\" messages, and I have experienced way more call drops since I changed to this cell phone. Also, the home screen rotates easily from vertical to horizontal, but it doesn't do the same backward. I have to shake the phone with some strength for the home screen rotate back to vertical. Overall, I am very disappointed with Nokia N97, but since I paid a good amount of money for it, I have to stick with it for a while."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480eb",
        "rating": 5,
        "comment": "I am very satisfied with this phone. Works great on AT&T 3G & EDGE networks. The Ovi Store is a great app store that allows you to download apps, themes, and other content for your Nokia phone safely. I would not recommend installing any apps that are not through the Ovi Store. I did and ended up having to reset my phone, losing some of the content that came originally on the phone. Great phone, though. Only drawback I have noticed is that depending on how you hold the phone, sometimes your voice comes across muffled to the person you are on the phone with."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48142",
        "rating": 3,
        "comment": "I am a big Nokia fan and really liked my 5800 and 5530, so I was quite looking forward to playing with the N97. This is a exquisite piece of hardware, the feel of the device is the nicest of any phone I have owned. But the software is really showing its age, even compared to newer, cheaper Nokia phones.Nokia really are asleep at the wheel, the 5530 shows they can do reasonable job of making a touch phone using S60 but they have let their S60 flagship lag far behind other S60 phones that are less than half the price. I gave both the 5800 navigation edition and the 5530 XpressMusic 5 stars based on the great usability and incredible value, but the wonderful N97 hardware is let down by old software.Good:- Wonderful hardware.- Excellent call quality- Very extensive feature set.- Very nice screen in sunlight.- White color looks great.- Nice keyboard (except space bar).- 32GB internal storage.Bad:- Home screen lacks scrolling contacts of 5530.- Inconsistent touch menu (some double, some single tap).- Very small space bar.- Mediocre browser.- Weak FM transmitter (not powerful enough for car use).- Ovi Maps lack search (you need to have google maps installed too).- No in-line spell check.Don't even waste your time comparing this phone to true smartphones like nexusone, droid or iphone 3gs, its just not in that league software wise, only price wise. When you see what google and apple have done so early in the smartphone game, it really is a shame for Nokia. Such great hardware let down by such bad software. And before you say N900, I had one and returned it, maemo shows promise but is far from ready for primetime use and the hardware is a brick.If you have lots of money, already like Nokia S60 phones and have never used an iphone or droid you should love this phone. Everyone else steer clear of it, looks at the 5800 or 5530 if you wanna go Nokia."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a3",
        "rating": 3,
        "comment": "The phone is very clean looking and I loved the keyboard and everything. However, the OS of this phone is old-school looking, and I didn't like that I had to use my nail to select things on the phone. I was use to the iPhone where you use your actual finger. The phone does let you use your fingers, but you end up choosing stuff that is above, below, or next to it. They give you an option to buy a stylus, but why do you HAVE to get a stylus to get better performance from the phone?There were also quite a few buggy problems that I had with the phone, but not serious enough to handicap the phone. This is a nice phone if you don't care about specifics and just need a phone to do basic things on.The camera I didn't feel was as awesome as they keep advertising. The quality was good enough but that's it. Not a huge WOW factor. Video was the same. Then again it is a phone, not a digital camera. I didn't like how I would turn off the flash of the phone and the light still went off when I took the picture (hard to be discreet).Overall, I think the phone was okay, had more cons than pros in my opinion."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48111",
        "rating": 4,
        "comment": "Symbian is an acquired taste, if you don't like/not used to s60v5, you won't like it even with 2.0 firmware. 2.0 firmware is what the N97 should have been released with. Given the N97 mini is $50 cheaper and it is 99% of what the N97 is, I would get the mini instead."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48151",
        "rating": 4,
        "comment": "Nice phone. Does not have the license to use all the applications included in it like the document editors, etc."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48178",
        "rating": 4,
        "comment": "This phone and the Nokia service are superb. After the V2.0 Firmware update the phone runs smooth and fast. All the issues i was complaining about when I got it got improved and now it is a perfect phone. The keyboard is good the screen with kinetic scrolling are nice and the homescreen is not only good-looking but also very user-friendly. With 32 GB you can leave your mp3 player at home. It comes with a 3.5mm headphone clinch so you can use your normal headphones.I needed to send it already to repair because i dropped it really hard on the floor. The phone wouldn't switch on anymore and the slider was damaged, too. I send it for repair hoping not to pay anything. I waited a week for a email and actually wanted to call already but then the phone arrived without send me even an email. One week, inclusive shipping! The most impressive part was that they didn't just make it work again, but they also corrected all cosmetic damage. I didn't get a bill or anything. I was really surprised and that is a major + for this phone.I have to take off one point of this phone because of the Ovi Store. Most apps are ''light'' or you have to pay. There are actually very few apps only available. Most of the Ovi stuff are wallpapers and really bad ringtones. They have to really improve that store.My conclusionN97+appstore=the perfect phone. It is still an iphone killer i would say. If you're not to main stream and like phones nobody really has. Go with this. It's nice"
      }
    ]
  },
  {
    "title": "AT&T LG CU405 No Contract Push To Talk Quad Band GSM Global Cell Phone Black",
    "brand": "LG",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480ed",
    "price": 38.95,
    "reviews": []
  },
  {
    "title": "Alltel LG AX390 AX-390 AX 390 SPECIAL FOR PAGE PLUS",
    "brand": "LG",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d48154",
    "price": 38.95,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48127",
        "rating": 4,
        "comment": "it was what i needed."
      }
    ]
  },
  {
    "title": "LG 410G Flip Phone (TracFone)",
    "brand": "LG",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d48161",
    "price": 16.66,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48124",
        "rating": 5,
        "comment": "didn't buy ?"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e1",
        "rating": 1,
        "comment": "No Camera in phone as advertised. Model received was not new and was at least 3 years old.Thank You,Wayne"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ee",
        "rating": 5,
        "comment": "Whenever I need an untraceable throw away phone for obscene phone-calls..prank calls ..bomb threats..extortion and blackmail..this is my number one choice."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c4",
        "rating": 4,
        "comment": "this item works ok and it worth more than the money i pay for it / i will recommended anyone to have one"
      }
    ]
  },
  {
    "title": "Apple iPhone 4 8GB Black - Cricket Wireless",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d48155",
    "price": 179.99,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "Apple A1533 Unlocked iPhone 5S Smart Phone, 16 GB (White)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d48168",
    "price": 115.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4810a",
        "rating": 5,
        "comment": "Love it. Excellent condition and beautifully packaged."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48165",
        "rating": 5,
        "comment": "Excellent purchasing experience. Item just as described, new and in original packaging. Speedy shipping too!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4810b",
        "rating": 1,
        "comment": "this cellphone scren is locked ,needed to enter pin , I don‘t know why ,anyonecan gime a advice?"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a4",
        "rating": 5,
        "comment": "Awesome phone, mine came and there were no scratches on it and it was 100% fully functional."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48167",
        "rating": 5,
        "comment": "excellent"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48125",
        "rating": 5,
        "comment": "It's going great"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814c",
        "rating": 5,
        "comment": "Just the right phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480fe",
        "rating": 4,
        "comment": "Very few scratches and works great. Wonderfully fast shipping and nice service."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48117",
        "rating": 3,
        "comment": "The phone showed up a day early which i was excited about! It was unlocked and easy to set up! It actually didn't have any scratches or noticeable damage or scratches anywhere! I knew the charger wouldn't be the orginal but the charger i got didn't last long. the charger started to mess up and i have to play with it to get it to charge until i can get a new charger :( the charger is the only reason i don't give 5 stars."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Nokia N97 Unlocked Phone, Touchscreen, 3G, 5 MP Camera, A-GPS, 32 GB, MicroSD Slot, and Integrated Ovi Applications--U.S. Version with Warranty (Black)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d480d8",
    "price": 173.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48175",
        "rating": 3,
        "comment": "I bought my N97 from Amazon in July, but since day one it shuts down on me at least once a day. This is really annoying specially when it does not turn back on immediately. Besides this inconvenience, the N97 is really a great phone with nice features and a much easier to use touchscreen when compared to the Iphone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48174",
        "rating": 1,
        "comment": "I never thought I would hate a piece of technology, but the N97 phone changed everything. The N97 was a big disappointment from the very first moment of handling it. The battery cover refused to go on. After thirty minutes of failing and sore fingers, I started reading the manual. For god's sake, I shouldn't need to read the manual to put on a battery cover! The manual was of no help and I began to be violent with it until it was forced on. It has been downhill from there.The N97 is of an exceptional poor design; It looks common from the outside, and is garbage on the inside. Let me review each main function separately:1. Voice: The phone is awkward to hold and speak. The addition of a keyboard really makes it heavy and fat.2. Contacts: This is the WORST aspect of this phone. The phone RANDOMLY chooses when to display an incoming caller Id! All you get is a phone number, and good luck trying to remember which phone number belonged to whom in your contacts. I have had this phone for 5 months now and I still do not know how to fix this major issue. At first, I thought I needed to transfer all the SIM card contacts to the phone's memory contacts, but this did not work.3. Keyboard: The keyboard is not practical. You have to use shift keys for numbers and symbols. A shift key for a period or a colon. A shift key for a smiley face. A terrible Idea.4. Web: The web browser is slower than death, and unresponsive. At one point I almost cracked the screen while surfing from all the frustration. Once you access a web page it is another task to scroll down or sideways.5. GPS: if you are in a pickle or driving and need some quick help finding your way, then don't even consider the N97 as an option. The GPS does not lock onto a signal quickly, it takes the phone a minimum of 15 min to find a signal, and one time it took me 45 min!6. Applications: No good apps. There are applications for facebook, twitter and myspace. However, they are not enjoyable to use. If you have your N97 while among a group of iphone users you will be ashamed to show it off. You look at all those apple users play and laugh about the cool apps they have on their phone, while I am still wondering who is calling me, because this phone can't display the name from the contacts.7. Camera: the photos are OK, not great thought. The flash is a big waste of power, it gives those being pictured a sickly jaundiced look.I urge all who see this to NOT buy this phone, and to tell all their loved ones not to as well. I on the other hand am cursed with this abomination, this travesty of dysform and dysfunction, until I can afford another phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4817c",
        "rating": 5,
        "comment": "I loved this phone.. I bought it for my sister and she too loved it. It has all the latest features that any mobile should have and it closely resembels iphone in functionality. No doubt it is not as complete as iphone but yes it has that style and looks that could make it more popular.The price was excellent, amozon is the best.. It was cheaper here that if we bought it in India. So it was worth a buy!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813a",
        "rating": 5,
        "comment": "Amazing piece of hardware. Fast, reliable, has all the basic application I would like it to have. Great camera, nice touchscreen, the keyboard helps a lot. The only thing I miss are better PIM tools. When registering a new contact, it is not easy to access address data as well. As a rule of thumb, it's to-do and memo notes are less intuitive than Palm applications. Aside form that, again a magnificent piece of hardware."
      }
    ]
  },
  {
    "title": "Honor 8 Unlocked Phone 32GB, Sapphire Blue (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d48148",
    "price": 399.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480da",
        "rating": 5,
        "comment": "Really a good cellphone, decent price but high quality. Worthwhile to buy it.Huawei honor 8USB type C, USB 3.08 core CPU, 4GB ram, 32 GB rom, SD expand storage supported (up to 128 GB)4G suitible for AT&T, micro phone cardinterial battery, normally two days use per chargecamera really good 800 W front and 1200 W backglass surface for both sides"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f9",
        "rating": 5,
        "comment": "The best smartphone... Period."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48172",
        "rating": 5,
        "comment": "Most beautiful phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f8",
        "rating": 5,
        "comment": "this phone replaces my 5x..which a liked very much. can't evens begin to tell you how much i like this phone. it has all of the features lacking in my 5x, plus it's faster, smaller, thinner and lighter..also love the Huawei apps like soft off, mail and music they are much nicer than any 3rd party apps i have found.PRObeautiful phonesmaller and lighter than 5xquality is excellentvery comfortable in the handfingerprint scanner works very fast and is well positionedC-Type USBNFC for Android Paydual band ac 5 GHz WiFifast processor4gb RAM which is enough for my usagevery nice camera with lots of featuresCONFlashlight gone from SettingsDouble-tap to wake gone3.5mm audio jack relocated to bottomonly one speaker on bottom"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812a",
        "rating": 5,
        "comment": "wow for the price its a bargain would recommend to anyone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4817f",
        "rating": 3,
        "comment": "Although the phone has many positive qualities, it doesn't justify the $400 price-tag.It has a beautiful design! As everyone else has stated, the glass finish is gorgeous. It feels solid in the hand and the screen is bright/gorgeous.The processor is lightning fast, hit about 91k in Antutu benchmarks.Cameras are solid, both front/back.Battery life is GOOD, about 4-6 continuous use or 10-12 hours of on/off use.Bluetooth is weak, same as Honor 5x - my bluetooth headset would crackle and loose connection when I would put the phone in my back pocket.GPS is spoty - sometimes it would think I'm 10 blocks away (same as the Honor 5x)The fingerprint reader is awesome - it doubles as a BUTTON and can be programmed to do several things (1 press turns on flashlight, 2 presses turn on camera, etc.)Compared to my iPhone 6s, I prefer the feel and look of the Honor 8, but for around the same price you can now get an iPhone 6S which is more powerful & reliable."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48146",
        "rating": 5,
        "comment": "Very impressive looking with the back glass, fast, and powerful battery. I have so far only got to below 60% once after a work day use. Best product for the price!"
      }
    ]
  },
  {
    "title": "LG Cam Plus CBG-700 Comfortable shooting grip for LG G5, 100% Original, OEM",
    "brand": "LG",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480cb",
    "price": 24.9,
    "reviews": []
  },
  {
    "title": "Apple iPhone 4 32GB (Black) - Verizon",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d4815f",
    "price": 69.98,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ab",
        "rating": 5,
        "comment": "Thank you the phone looks like it is brand new and works great! Couldnt be more happy with the product. highly recommended!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b6",
        "rating": 4,
        "comment": "I've had this iphone for over a month and its easy to use and fun. The earpiece did stop working for awhile but it seems to be working now."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48130",
        "rating": 5,
        "comment": "After Verizon changed its upgrade cycle that coincided with both of my phone upgrades, I was left to either replace my son's non-functioning phone by purchasing an iPhone 5 for over $600, wait for next year to upgrade/replace or pay $200 to repair my son's originally free phone. I opted to check out what was being offered for last year's iPhone on Amazon and found a reasonably priced slightly used iPhone 4 with a great deal of memory. The device works as expected, no blemishes (at least none that I could find and I think there was mention of typical minor wear and tear - I saw none but I think that has to be put out there for used/refurb devices) and all cords, chargers were included in packaging. It was delivered early and my son is thoroughly pleased to go from a free Samsung smartphone to an iPhone 4 (granted he wanted the 5 but he's 15 - he'll live...besides he's happy to be at the same level his friends are at with their phones). I will be purchasing my phone this way and going outside of Verizon's market from now on. This seller is outstanding, the service and quality easily exceeds expectations. Thoroughly pleased!!!!"
      }
    ]
  },
  {
    "title": "Google Nexus 6P 64gb Graphite (Black) US Warranty.",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 11,
    "seller": "60a548b93e6aa47fb3d48103",
    "price": 161.06,
    "reviews": []
  },
  {
    "title": "Apple iPhone 2G 8GB (Black)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d48170",
    "price": 129.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ea",
        "rating": 1,
        "comment": "Charger not work"
      }
    ]
  },
  {
    "title": "LG C2000 for Cingular AT&T",
    "brand": "LG",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d4816f",
    "price": 24.9,
    "reviews": []
  },
  {
    "title": "Apple - Iphone 5c A1532 Verizon 16 GB Cell Phone - Green",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d4814b",
    "price": 33.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4809e",
        "rating": 5,
        "comment": "Was a gift for my husband and he loves it. Replaced a first gen droid so there was no place to go but up.The phone came in a plain white box with charging cable. It looked brand new and unused.So far it has performed as a new phone with no troubles whatsoever."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48176",
        "rating": 5,
        "comment": "Great price, extremely fast shipping works as advertized!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e0",
        "rating": 4,
        "comment": "Moving from Android to Apple...my kids have this phone too and keep me straight on using it. Phone is superb and, while Apple has its moments, it is intuitive to use. Seller was VERY responsive...only reason not a 5 star is \"new\" phone had been opened for imei verification. Not sure that's industry standard. If it is, seller is 5 star."
      }
    ]
  },
  {
    "title": "Cu515 Black Flip",
    "brand": "LG",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d480d7",
    "price": 13.33,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480c0",
        "rating": 5,
        "comment": "Great!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480dd",
        "rating": 4,
        "comment": "ty"
      }
    ]
  },
  {
    "title": "Sony Ericsson Vivaz U5a Unlocked Phone with Symbian, 8.1 MP Camera, HD Video, Wi-Fi and GPS - U.S. Version - Blue",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480b3",
    "price": 136.5,
    "reviews": []
  },
  {
    "title": "Samsung Blast T729 Unlocked Phone with QWERTY Keypad, 1.3 MP Camera, Bluetooth and MP3 Player - US Warranty - Crimson Red",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d48147",
    "price": 39.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48108",
        "rating": 1,
        "comment": "Did not work"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815d",
        "rating": 3,
        "comment": "I purchased this phone to replace one just like it. Appreciate the price and it arrived in a timely manner. It's the phone itself. I need to upgrade and get a phone where I don't have to press the screen (wears out) - maybe a flip phone. Or even get into the more modern phones"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f5",
        "rating": 2,
        "comment": "I bought this phone for my son. It says it has a Querty keyboard. This keyboard is terrible. Each letter does not have its own key, instead its much like using a regular number pad. Very cheap. If you want an inexpensive phone that doesn't do much and you don't ever text, it might work for you."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48162",
        "rating": 1,
        "comment": "Maybe this was \"the bad one\" in the batch, but I didn't even have the phone for a month and without dropping it at all and very gentle use just for calls and texting it suddenly turned off and never came back to life. I researched several phones and just needed something simple and I admit I loved the phone, but sadly I got attached just when it turned off twice in a week and on the last time, I gave up and returned it, fortunately I did get refunded."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48098",
        "rating": 1,
        "comment": "The phone that was sent to me was an T mobile phone that needed a sim card, which my old phone didn't require. So I had to return the phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f3",
        "rating": 5,
        "comment": "This phone is great for the price. Has good sound quality on songs and while on the phone. Microphone is good too.this phone feels solid and doesn't feel loss when the sliding motions yup and down. And love the design of this phone as well. Samsung is a good quality phone maker and they will always be the second best cause HTC is the best"
      }
    ]
  },
  {
    "title": "New 5.5\"Sony Xperia C4 E5333 Black Factory Unlocked International Version no warranty",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d480f6",
    "price": 75.0,
    "reviews": [],
    "disabled": ""
  },
  {
    "title": "Honor 5X Unlocked Smartphone, 16GB Sunset Gold (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d48094",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48131",
        "rating": 5,
        "comment": "Very Good.Repeat purchase in short time."
      }
    ]
  },
  {
    "title": "Samsung A670 Phone (Verizon Wireless)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d480ee",
    "price": 16.5,
    "reviews": []
  },
  {
    "title": "Sam Galaxy J7(2016) Dual J7108 4G 16GB Gold",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 7,
    "seller": "60a548b93e6aa47fb3d4817b",
    "price": 231.0,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480ce",
        "rating": 5,
        "comment": "It works excellent for my needs"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4815e",
        "rating": 5,
        "comment": "This phone is nothing but #AWESOME. The picture quality alongside with the initial device itself is great. To be honest, it's worth the price and even my friends like the phone."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48143",
        "rating": 5,
        "comment": "Excellent!! Phone from Samsung. worth of money. As this is the latest 2016 edition which come's with almost new features."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Apple iPhone 4 8GB, White, for Straight Talk, No Contract",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d48134",
    "price": 72.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48105",
        "rating": 3,
        "comment": "man i order this on December 29, 2015 and it said it will be arriving Janurary 5-8 but it came Janurary 2,2016 and it works came with charger only think wrong with it is that it comes dead i made sure to plug in and see if it works but i recommend it to anyone trying to buy this"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48126",
        "rating": 5,
        "comment": "Great condition. Thanks."
      }
    ]
  },
  {
    "title": "New Nokia Lumia 1320 GSM Unlocked LTE Windows 8 Cell Phone - Black (No Warranty)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d48105",
    "price": 99.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4817e",
        "rating": 5,
        "comment": "Windows is the greatest tbh"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48155",
        "rating": 5,
        "comment": "Love...LOve....LOVe...LOVE this phone!!!!!! It is absolutely amazing!! Very advanced and the touch response is very quick. I love the size of the screen and the actual size of the phone. It's pretty huge but the phone could actually fit in your pocket (a good size deep pocket). 2 drawbacks are: Sound could be louder when playing music from the phone's music app and 2nd, camera could be better...but in regards to the latter statement, I believe you can download any type of camera u want and use the downloaded camera for photos instead of the default camera."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4817d",
        "rating": 4,
        "comment": "Works excellently. I bought two, one for myself and one for my wife and I must say it has worked well so far."
      }
    ]
  },
  {
    "title": "LG Cosmos VN250 Black No Contract No Data Verizon Cell Phone QWERTY Keyboard",
    "brand": "LG",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d480f0",
    "price": 7.33,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480df",
        "rating": 5,
        "comment": "My grand daughter really likes her phone and had not had any problems with it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d1",
        "rating": 5,
        "comment": "very nice phone-no issues at all. received it very promptly, also!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813e",
        "rating": 5,
        "comment": "used this phone for 6 years before a 14 foot drop onto concrete finally did it in (it still sort of works but not reliable). So I bought a new phone (different manufacture) it lasted 11 days. So I got online and ordered another Cosmos. I hope they make them forever because the other phone I bought was cheap and poorly made. This phone is solid and I know will last me."
      }
    ],
    "disabled": ""
  },
  {
    "title": "4G-Unlocked Huawei Honor 6 5.0 TFT LTPS Screen 1920 x 1080 pixel 13.0MP Camare Android 4.4.2 Kirin 920 Octa-core Smartphone 3GB RAM+16GB ROM Dual SIM (white) - International Version No Warranty",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480ba",
    "price": 161.06,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480f6",
        "rating": 4,
        "comment": "Really nice phone, it's not working in USA 2G-3G-4G"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480bf",
        "rating": 5,
        "comment": "very good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48097",
        "rating": 1,
        "comment": "Bad very bad and not support Google play store"
      }
    ]
  },
  {
    "title": "Samsung Blackjack II SGH-i617 for AT&T (Black)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d4810c",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48170",
        "rating": 1,
        "comment": "it dont work at all n i want a refund"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480bd",
        "rating": 4,
        "comment": "I went many years before upgrading to a smart phone. I have used 3 Blackjack phones. The only thing I didn't like was how this version changed the port sizes from the previous version. I had to rebuy some chargers for this phone to work."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48122",
        "rating": 5,
        "comment": "it is very good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b2",
        "rating": 5,
        "comment": "I received this phone today and was very happy, the phone is in very good condition I am so please with my purchase."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480b9",
        "rating": 5,
        "comment": "this phone i got for my mom as a gift because she isnt into smart phones. its simple and easy to use and navigate. she loves this phone. its perfect for someone who isnt into touch screens"
      }
    ]
  },
  {
    "title": "LG 2X P999 8GB Unlocked GSM Phone with Android 2.3 OS, HDMI, Nvidia Tegra 2 Dual Core processor, 8MP Camera, IPS LCD Touchscreen, GPS, Wi-Fi, Bluetooth, FM Radio and microSD Slot - Brown",
    "brand": "LG",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d480c2",
    "price": 108.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4817b",
        "rating": 5,
        "comment": "I've had my G2X from the year it first launched and when it finally gets beat up to the point where I need a new one (I'm rough on phones), I order the same one. No upgrading or changing for me. It works nicely. Never have trouble!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a1",
        "rating": 2,
        "comment": "This phone does not live up to how it is promoted. My husband has a cheapLG that will run on 3G and this phone is advertised for 4G but wouldn't evenrun at 2G. The Seller was very easy to work with and I would not hesitate tobuy from them again. They sent me an email to see if I was satisfied withthe product and did not hesitate to give me a full refund when I asked for it."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809f",
        "rating": 5,
        "comment": "Ordered my phone after looking at for a couple days,am very impressed by the quality of the phone, arrived on time and am loving it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d6",
        "rating": 5,
        "comment": "its amazing how some people say the phone is crap and other people say it's great, we have had nothing but positive things to say about it.Gave it to my wife for her first android smart phone.She reminds me how much she likes it.battery last long, very fast, feels good in your hand, the only thing I can get a negative is that it needs a message light.don't get hung up on software updates 2.3 .5 works great. Have added 400 songs I'm still have 4gig to go on memory.hotspot and wifi works perfect.after researching just about all phone this 1 seems like the best deal.Enjoy it. We do."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48189",
        "rating": 4,
        "comment": "This phone is great, a nice size and easy to touch and drag. It came ready to go for my sim card and even had the hdmi cable in it.. love it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48115",
        "rating": 4,
        "comment": "I was NOT packed in bubble wrap. So during shipment. The inside were shaking/moving. So far it works well. As advertised. Happy with my order. Thanks!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e4",
        "rating": 5,
        "comment": "I am loving this phone.It takes very good pics/videos.The processor is fast and android platform give alot of options for apps.Internet browsing is excellent.No faults with phone so far!!"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48157",
        "rating": 4,
        "comment": "Excellent phone without breaking the bank and staying out of contracts. Good enough for use as a late model smartphone, improved battery life on newer models might convince me to switch in the future.I noticed that after some time the digitizer stopped responding, even though the phone was never subjected to any shock."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4816e",
        "rating": 5,
        "comment": "I bought a used one for 200 last year, it lasted a year until I hurled it repeatedly into the wall last week. Now I am buying another 1. I had a simple hard rubber case and screen protectors that helped it remain in mint condition, though being dropped constantly. Despite the camera flash only working sporadically after the phone updated itself, it is very reliable has excellent cameras Great HD. I recomend turning the phone off once a day. It can keep tons of apps running in the background and still stream HD vids and take calls without an act of congress. Everything runs the way people with I-phones wish their phones would work. ***Also Tmobile has *4 gigs of *4g speed with *no contract and *unlimited texts for * $30.00 a month and has download speeds of 8mb per second on average. Don't be a sucker. Since the plan only has 100 anytime minutes it may be necessary to get a simple unlimited talk phone for 20 a month, essentially having 2 phones with unlimited everything for 50 per month with no tax. LOL. And but the best 4G internet there is (Having tried Sprints \"Unlimited Data where they throtlle the hell out of your ass and knowing the evil ways of Verizon, I try not to reward there scumbaggedry). Or you could be moocher and get an Obama Phone to compliment your Smart Phone that you bought with your welfare $. :("
      }
    ]
  },
  {
    "title": "Apple iPhone 4 8GB Verizon CDMA Smartphone - Black",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d4817d",
    "price": 179.99,
    "reviews": []
  },
  {
    "title": "LG A275 Black Unlocked GSM Dual SIM QuadBand Cell Phone - International Version - No Warranty",
    "brand": "LG",
    "image": "imageurl",
    "stock": 12,
    "seller": "60a548b93e6aa47fb3d48180",
    "price": 50.5,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480fb",
        "rating": 5,
        "comment": "This is a great little phone. It has two SIM slots so you can choose which account to send/call from. It differentiates between the accounts in your contact list by color and provides you the ability to set a default account but still operate from the other for individual actions if you would like. The one down side is it is not a smart phone so for a guy who is used to the 'swiping' function for texting on my Samsung, using this type of phone for texts is a bit of a drag--but that is not the phone's fault. The battery life is great on this--I only have to charge it about once a week (I am not on it much though--if I was calling or texting more that would probably not hold true). No games or other fun features, but if all you are looking for is a dual account phone, this is a great option--especially for the price. I have used it in Europe and in Africa. No issues or worries."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ae",
        "rating": 3,
        "comment": "I bought two and one did not work. The Airtell office in India said that the phone was defective. The other one worked well and i was able to use the sim card I had bought for the first one on the second one. I would like to return the defective one."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c7",
        "rating": 5,
        "comment": "I travel around the world im seaman Reliable back up phone .good any where i go from asia , western TO uk tested easy to.used"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813f",
        "rating": 3,
        "comment": "The phone works Ok with Chatr in Canada. However, it's a very cheap phone and the manual sucks. One thing that does not seem to work at all is the phone lock with password: One needs to set it up every time before locking the phone because the password protection is disabled every time one unlocks this phone."
      }
    ]
  },
  {
    "title": "AT&T LG Neon GT365BLS QWERTY Camera Phone",
    "brand": "LG",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d480b0",
    "price": 14.44,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480a5",
        "rating": 1,
        "comment": "Disappointed - we need to tide over our accounts prior to being upgrade eligible, and this refurbished, \"tested\" phone seemed like a good idea because it was similar to what we already had, and the price was right. Unfortunately, the microphone was not functional, so basically it is only good for texting. Also, the prior owner's phone numbers were still on the built-in SIM card so that was kind of weird. Not sure what to make of it and I'm sure every one of these for sale will be different, but our experience wasn't so great."
      }
    ],
    "disabled": ""
  },
  {
    "title": "'ATT Wireless LG CU720 Shine for in Red'",
    "brand": "LG",
    "image": "imageurl",
    "stock": 6,
    "seller": "60a548b93e6aa47fb3d48138",
    "price": 25.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48169",
        "rating": 5,
        "comment": "all good"
      }
    ]
  },
  {
    "title": "Microsoft Lumia 950 RM-1104 5.2\" 20mp 3gb Ram 32gb 4g Smartphone International Version No Warranty (white)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 4,
    "seller": "60a548b93e6aa47fb3d480b4",
    "price": 578.98,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48140",
        "rating": 4,
        "comment": "Works great I love the phone the only thing I didn't like about it was it came with an Australian charge cord they put an adaptor in with it but it should have been listed it was this way"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4814a",
        "rating": 3,
        "comment": "OS is solid. Build quality isn't. Front facing camera isn't that good. Battery consumption is ridiculous - hogs a lot! App support is awful. Probably won't be using this for long."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811f",
        "rating": 5,
        "comment": "Great phone. Nothing I don't like about it.Screen: Excellent response and looks great.Battery: I go a full day on a charge. You may not if you're using it for a wifi connection or voice all day. The fact that the battery is so easily replaceable is HUGE for me. I just carry an extra battery in my backpack. When the battery is low I can simply swap it. Best possible option for me. I've never that guy at the airport running around looking for power like iPhone owners.Cover: This is different from any other phone: the case IS the cover. So when you buy a new case you're replacing the entire cover of the phone. So your case doesn't need to fit over the factory case - it replaces it. Very nice design. So many nice cases available for this phone. I have a leather case that gets compliments all the time.OS: I think you either like Windows Phone OS or you don't. Very intuitive to me. Does what I expect it to when I expect it to. I like the tiled navigation page. So easy to rearrange and resize tiles.The only issues I can see with this and other Windows phones is the lack of software support. Waze, for example is fairly crippled on Windows vs. Android. All the other apps I need are there. But clearly far fewer apps than Android and iPhones have. Not an issue for me."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48101",
        "rating": 4,
        "comment": "good camera, phone is good; wi fi not as good as the model 640. Personally the 640 is a better phone for less than a third the price."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48129",
        "rating": 5,
        "comment": "got this to replace my htc one m8 which I had dropped in 5 feet of water while at lake. Always wanted a 950 but was initially too expensive I purchased a dual sim 950 for 309.00 setup was eay and the phone works great could not be more pleased"
      }
    ]
  },
  {
    "title": "Samsung Behold 2 II T939 Unlocked Android Phone with 5MP Camera, Touchscreen, Wi-Fi and Bluetooth - Unlocked Phone - US Warranty - Brown",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 5,
    "seller": "60a548b93e6aa47fb3d4810a",
    "price": 99.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480dc",
        "rating": 5,
        "comment": "Good phone. I sent it to Europe for my mother in law."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480a9",
        "rating": 5,
        "comment": "Excellent seller! A+++"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813b",
        "rating": 3,
        "comment": "chimbo"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480f2",
        "rating": 3,
        "comment": "This was a reasonable purchase. The product performed as described and the price was adequate. I recommend the purchase to everyone who understands the details."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Samsung Alias SCH-U740 No Contract Verizon Cell Phone",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d48183",
    "price": 69.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d4812b",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e2",
        "rating": 5,
        "comment": "I like this phoneI like this phone to only letters are small to text with but still like the phone to talk on"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4811d",
        "rating": 4,
        "comment": "I enjoyed this phone years ago and tried the new smartphones and was not happy with it. Found this alias phone and have been very happy with it"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48141",
        "rating": 5,
        "comment": "This is one of my favorite phones that I have had over the years. It is light and compact and gives you dual functionality with a full keyboard for texting."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ac",
        "rating": 3,
        "comment": "I bought this phone as a Christmas present for my husband, it was his favorite phone since we went wireless years ago. The reason for three stars is only because the phone is an older model, so the verizon backup wouldn't work on this phone, I had to take it to a verizon store and have a technician download all my husband's information for me. Other than that, it is a great phone"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48121",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e9",
        "rating": 5,
        "comment": "I like this phoneI like this phone to only letters are small to text with but still like the phone to talk on"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48119",
        "rating": 4,
        "comment": "I enjoyed this phone years ago and tried the new smartphones and was not happy with it. Found this alias phone and have been very happy with it"
      }
    ]
  },
  {
    "title": "LG Cosmos Touch VN270 Verizon Cell Phone / Touch Screen / QWERTY Keyboard / No Data Plan",
    "brand": "LG",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d4812d",
    "price": 18.43,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480e9",
        "rating": 2,
        "comment": "Battery doesn't last a day. I even spent $40 dollars replacing the batteyr hoping that was the problem, but the new one doesn't last a day either. I am going back to the non-touch version, it isn't worth it."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48119",
        "rating": 1,
        "comment": "The touch screen stopped working well almost immediately, had to push really hard on the screen and swipe to get it to work at all and even then it didn't sometimes. And after almost three months of just making it work (not sure why), one of the sliding sides came off it's track. The phone broke in half soon after. Maybe they're not all like this but I wouldn't buy another."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48183",
        "rating": 3,
        "comment": "Not the best phone I have ever had, but I wanted a phone with a full key board and no Data plan. I got that. Phone just doesn't work well, but it works."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480ff",
        "rating": 2,
        "comment": "After 4 months the touch screen entirely stopped working. and since this phone is entirely dependent on the touch screen it's basically useless."
      }
    ]
  },
  {
    "title": "Apple iPad Pro ML0N2CL/A (128GB Wi-Fi Space Gray) (International Model no Warranty)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 13,
    "seller": "60a548b93e6aa47fb3d48137",
    "price": 115.0,
    "reviews": []
  },
  {
    "title": "LG B220 Unlocked GSM Quad-Band Dual SIM Phone (Black)",
    "brand": "LG",
    "image": "imageurl",
    "stock": 9,
    "seller": "60a548b93e6aa47fb3d480d3",
    "price": 24.9,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d48158",
        "rating": 1,
        "comment": "The phone may work fine, but the charger does not fit US electrical outlets."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4812c",
        "rating": 5,
        "comment": "Item recieved in perfect condition"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48120",
        "rating": 1,
        "comment": "Purchased as a replacement for an old flip phone which got great reception all around town. With the same SIM card, this one is spotty at best and keeps dropping calls; unusable."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48133",
        "rating": 3,
        "comment": "flash light should be easier accessible ,by the press of one button."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480cd",
        "rating": 5,
        "comment": "The Blu cellular is so difficult to open to place battery and SIM that I'm not even going to waist my time returning it since I'm leaving in two weeks to South América that I Will look for someone to Buy it from me, this is the second time that I buy a BLU cellular and both times have been negative about it, they should find another system in order to remove the back plate, not even with a screw driver can you remove it, there are no even instructions on how to do it, shame on the company who makes them."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4809b",
        "rating": 5,
        "comment": "Good product."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d4813c",
        "rating": 5,
        "comment": "Great"
      }
    ]
  },
  {
    "title": "Sony ericsson W380a Electric Purple-Unlocked GSM Phone",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 8,
    "seller": "60a548b93e6aa47fb3d4809a",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480f4",
        "rating": 1,
        "comment": "waste of money"
      }
    ],
    "disabled": ""
  },
  {
    "title": "Huawei Ascend G6 MTK6589M 1.2GHz Quad Core 4.5 inch 3G Android 4.3 Smart Cell Phone RAM 1GB ROM 4GB WCDMA GSM Dual SIM (Black)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 5,
    "seller": "60a548b93e6aa47fb3d4817a",
    "price": 103.49,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480a8",
        "rating": 1,
        "comment": "Didnt came with the pink case offered. 1 week of use and the screen go bad damaged with strips."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480e5",
        "rating": 5,
        "comment": "very good"
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48104",
        "rating": 5,
        "comment": "excelent"
      }
    ]
  },
  {
    "title": "GreatCall Samsung Jitterbug Touch3 Senior Smartphone with 1-Touch Medical Alert and Large Display",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d480cc",
    "price": 149.99,
    "reviews": [
      {
        "reviewer": "60a548b93e6aa47fb3d480b0",
        "rating": 4,
        "comment": "Great phone, large display for size of screen, however the battery drain is high. It's reception and functions (especially if you change menu to Google) are great. It is a great value for someone who has to bring their own phone. It looks nice, it's much lighter than other phones but the metal case makes it look pricier. It's location makes perfect sense. When I bought it (in the beginning of the year) I spent hours reading reviews and watching reviews. It was one of the best rated in March 2016 for it's price range. I have not been disappointed."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48169",
        "rating": 2,
        "comment": "It don't work in Salyersville, Ky. I am trying to fix it in a different county in Kentucky."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d48138",
        "rating": 2,
        "comment": "Hard to setup. Difficult to use. Low speaker volume. NOT user friendly."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480c0",
        "rating": 5,
        "comment": "Has all I wanted in a smart phone at a fabulous price. It is just as I expected it to be. I like the size, quality, clarity, and user friendly format."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480dd",
        "rating": 4,
        "comment": "NOT OVERLY FAMILIAR WITH VERBAGE."
      },
      {
        "reviewer": "60a548b93e6aa47fb3d480d7",
        "rating": 5,
        "comment": "Love this phone, everything i need"
      }
    ]
  },
  {
    "title": "Honor 8 Unlocked Phone 32GB, Midnight Black- GSM- (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 10,
    "seller": "60a548b93e6aa47fb3d480e7",
    "price": 399.0,
    "reviews": []
  }
]